[
  {
    "name": "Adamantine",
    "description": "--- title: Adamantine ---  Adamantine’s secretive forging techniques are jealously guarded by the dwarves of the Bürach Empire, specifically in the dwarven thanedom of Rauland. The capital city of Sthelenwald stands amid the jagged mountains, its forges lit by glowing runes and watched over by stern dwarven overseers. Only those who earn the trust of these dwarven lords—through great deeds or impressive wealth—can gain access to raw adamant or have an item forged from it.  Adamantine is formed by blending adamant (mined from rare adamantite ores deep in asteroids or volcanic fissures) with silver and electrum. It is black with a green sheen in candlelight and impossibly hard. Dwarven master-smiths know how to temper brittleness into durability, creating armor and weapons that resist critical blows and cleave through hardened barriers. To learn its secret is to risk dwarven ire and imperial scrutiny.",
    "armor_effect": "The base Damage Reduction of the armor is increased by 4. While you’re wearing it, critical hits that strike you are treated as normal hits.",
    "armor_cost": "150 × base armor cost.",
    "weapon_effect": "",
    "weapon_cost": "50 gp + base weapon cost."
  },
  {
    "name": "Carapace",
    "description": "The Islands of Chult, lying in the southeastern waters of the Castinellan Provinces, are overgrown with prehistoric jungles and teeming with saurian beasts. While nominally independent, Chult’s resources—especially the abundance of monstrous shells, chitin, and hides—are coveted by surrounding nations. Expeditions from mercantile princes, adventurer companies, and imperial armies all vie for these raw materials, hoping to return home with enough monster carapace to craft exceptional armor.  Carapace armor is lighter than steel and can grant remarkable agility. Druids, frontier warriors, and tribal champions often wear it, drawn from creatures with immense natural DR. The process of harvesting and treating the shell is part of local Chultan tradition, involving complex rituals and dances meant to appease the beast’s lingering spirit.",
    "armor_effect": "This armor loses the cumbersome property if it had it. In addition, its maximum Dexterity modifier to AC is increased by 1. In addition you gain tremmor sence 15ft.",
    "armor_cost": "10 × base armor cost. There is an additional cost of 1,200 gp for medium armor and 2,000 gp for heavy armor. The price is reduced by 50% if you posses the body of a slain large-sized creature with DR 5 or more.",
    "weapon_effect": "",
    "weapon_cost": ""
  },
  {
    "name": "Darksteel",
    "description": "Darksteel was first smelted in Toletum, the capital of the Castinellan Provinces, after miners discovered rich deposits of dilmerithium in the Corova mountains. The Arcanist Inquisition and Sanctioned Witch Hunters, both influential factions in Toletum, arm themselves with darksteel gear to suppress enemy spellcasters. Anyone wishing to buy or sell darksteel faces oppressive scrutiny from the Inquisition, ensuring Toletum’s monopoly.  Darksteel disrupts magical energies, making it invaluable for capturing or combating spellcasters. It’s dark brown with a subtle sheen. Rumors say that some secret dwarven halls and hidden gnome workshops also know how to shape it, but the Inquisition’s spies ensure such knowledge seldom spreads.",
    "armor_effect": "While wearing Darksteel armor, you have advantage on saving throws against spells. Every other creature within 5ft of you make their concentration checks with disadvantage so long as they are within 5ft of you. Once a day, you can cast *counter spell*. This feature resets after a long rest.",
    "armor_cost": "50 × base armor cost.",
    "weapon_effect": "",
    "weapon_cost": "50gp + base weapon cost."
  },
  {
    "name": "Demonhide",
    "description": "Demonhide is infamous among the Hell Knight Paladin Order, a dogmatic and ruthless sect that wages endless war against demons. Operating throughout Etharis, they often haunt the borders of the Bürach Empire and Ostoyan frontiers, returning from their crusades with demon corpses. They craft demonhide armor to channel the demons’ regenerative properties against their enemies—though at a terrible cost to their own bodies and souls.  Demonhide fuses with the wearer’s flesh. Its leathery texture and faint infernal runes reflect the tormented essence bound within. Warriors who don it rarely do so lightly, as the corruption it may spread can be nearly as dangerous as the foes it helps them overcome.",
    "armor_effect": "Demonhide infuses with the wearers flesh, binding the hard leathery hide with the skin. Due to this magical symbiotic relationship, you can as an Action spend 1 hit-die and for one minute gain CON + 1 temporary hit-points per turn, provided that you have at least 1 hit point, as the Armor forcibly melds your flesh back together. After the effect ends you need to make a DC 10 CON saving throw. On a failure, you suffer one point of exhaustion.  Removing the Armor cost half of your health. The Armor can only be removed after a remove curse spell has been cast on it.",
    "armor_cost": "20 × base armor cost.",
    "weapon_effect": "",
    "weapon_cost": ""
  },
  {
    "name": "Dragonhide And Dragonbone Plate",
    "description": "Dragons are a plague, terrorizing regions of the Bürach Empire and beyond. Their hides and bones offer tremendous potential if properly worked. The secret of crafting dragonhide or dragonbone equipment is hoarded by The Green Blades, a secretive dragon-hunting society that operates in the shadows. Rumor places their hidden forges in the wilderness of the Charneault Kingdom or the broken borders of the Bale Route, where they engage in whispered trade with desperate hunters and The Red Hand assassins.  Dragonhide retains elemental resistances and can even harness draconic power. Crafters must carefully flense and tan the hide, praying the dragon’s lingering malice doesn’t curse the finished piece. Green Blades artisans are paid handsomely to outfit hunters, kings, or foolhardy adventurers daring to face a wyrm.",
    "armor_effect": "You wear the scales, hide and bones of one Dragon. While wearing this Armor you have advantage on saving throws against the Frightful Presence and breath weapons from the Dragons that are the same type as your Armor, and you have resistance to one damage type determined by the kind of dragon that provided the scales.  Furthermore, once a day, the you can use the armor to awaken the dragon spirit inside and gain immunity to the damage type for one minute.",
    "armor_cost": "5x the armor’s base cost for medium or heavy armor, or 600 gp for light armor, in which case the base armor type becomes exotic leather. There is an additional cost of 4,000 gp for heavy armor, 2,500 gp for medium armor, and 1,500 for light armor. This additional cost is reduced by 50% if you possess the body of a slain creature whose hide is mostly undamaged and sufficient for armor of this type, and by another 25% if you are able to skin the creature yourself with a DC 20 Wisdom (Survival) check. If you fail the check by 5 or more, the hide is ruined and cannot be made into armor. For a creature’s hide to be appropriate for a suit of armor, the creature must be of challenge rating 6 or greater.",
    "weapon_effect": "As part of an attack, you can unleash an attack that mimics the breath weapon of the dragon whose scales adorn your weapon. This attack takes the form of a 15-foot cone, within which creatures must make a Dexterity saving throw against a DC equal to 10 + your proficiency bonus modifier. On a failed save, a creature takes 4d6 damage of the type associated with the dragon's breath weapon, or half as much damage on a successful save. You may use this feature a number of times equal to your proficiency bonus, and all expended uses are restored after a long rest.",
    "weapon_cost": "200g + 5x base weapon cost."
  },
  {
    "name": "Ilithon",
    "description": "In the wake of Drakenheim’s horrific devastation—an eldritch catastrophe that twisted space and reality—survivors and craftsmen improvised. Strange crystals and shards of otherworldly matter litter the ruinous streets. Desperate artisans and psionic savants learned to shape these shards into Ilithon armor. Today, wandering merchants or daring scavengers poke through the irradiated rubble of Drakenheim to find the raw psychic materials needed.  Ilithon armor protects the mind, repelling psionic assaults and obscuring telepathic detection. Owning a suit marks you as someone who has ventured too close to Drakenheim’s madness, or who has trafficked with the psionically gifted outcasts eking a living in its devastated outskirts.",
    "armor_effect": "While wearing this armor, you gain resistance to psychic damage and immunity to effects that would read your thoughts, discern lies, determine your alignment, or reveal your creature type. Additionally, you control whether creatures can communicate with you telepathically.   When you take psychic damage, the source of that damage takes half of the damage dealt back to them.   Moreover, you can cast _mage hand_ at will, with the hand being invisible, and _telekinesis_ once per day. This feature resets after a long rest.",
    "armor_cost": "20 × base armor cost.",
    "weapon_effect": "",
    "weapon_cost": ""
  },
  {
    "name": "Ironbark",
    "description": "Only four wood elf masters remain in all of Etharis who can forge Ironbark. Legend holds each dwells in a grand forest: the Stormeaves, the Nightweald, the Skalan Hills woodlands, and a secret grove in the Charneault Kingdom. For a thousand years, their order has remained the same—one master, one apprentice. Ironbark forging is a sacred art; foreigners rarely earn the right to learn, let alone purchase Ironbark equipment.  Ironbark is grown from ancient, enchanted trees. In elven culture, forging it is a ritual that binds the spirit of the forest to the piece. Ironbark armor and weapons embody the harmony of nature and craftsmanship.",
    "armor_effect": "This armor increases the maximum Dexterity modifier to AC by 1. Wearers gain advantage on Stealth checks. Additionally, the wearer can cast the *Druidcraft* cantrip at will, and *Invisibility* once per day. This feature resets after a long rest.",
    "armor_cost": "15 × base armor cost.",
    "weapon_effect": "On a hit with an attack roll of 20 or higher, this weapon deals an extra 2d4 necrotic damage. The wielder gains temporary hit points equal to the necrotic damage dealt.",
    "weapon_cost": "2 gp + base weapon cost."
  },
  {
    "name": "Krakenhide",
    "description": "The Valikan Raiders rule the northern seas with blood and bravery. Amid ice floes and furious storms, these reavers hunt krakens—a sport no sane mind would attempt. To the Valikans, a kraken hunt is a rite of passage, and those who survive return with monstrous hides crackling with latent elemental power. A suit of krakenhide armor signals one’s status as a legend of the icy seas.  Krakenhide preserves the monstrous strength and elemental fury of the deep. It grants incredible aquatic mobility and the power to hurl bolts of lightning, reflecting the kraken’s own devastating might. Acquiring it demands not just a successful hunt, but the favor of the Valikan clans who consider these hunts sacred.",
    "armor_effect": "While wearing this armor, your swimming speed is equal to your walking speed. If your swimming speed already is equal to walking speed, the swimming speed is instead increased by 10ft. In addition, as a bonus action you can expend half your hit-die and magically create a bolt of lightning, which can strike a target you can see within 90 feet. The target must make a DC 16 DEX saving throw, taking 1d10 per proficiency level lightning damage on a failed save, or half as much on a successful one.",
    "armor_cost": "100 × base armor cost. Includes bribes, commissions, and securing rare components at expensive northern auctions.",
    "weapon_effect": "",
    "weapon_cost": ""
  },
  {
    "name": "Mithral",
    "description": "Mithral deposits are fiercely controlled by the City-State of Morencia and the fractious Thousand Rivers Kingdoms. Once they discovered veins of this precious ore, these nations forged pacts and hired elite mercenaries and assassins to maintain their monopoly. Rival powers seeking mithral often vanish mysteriously, ensuring the material’s scarcity and inflated prices.  Mithral’s silvery-blue metal defies elemental damage and can unpredictably repel magic. Elves prize it for its lightness, while dwarves value its resilience. Securing raw mithral ore likely involves secret negotiations or daring infiltration of Morencia’s guarded mines.",
    "armor_effect": "This armor loses the cumbersome property if it had it. Mithral armor also becomes one armor category lighter, Heavy armor loses its Strength score requirement and light armor can be used without any armor proficiencies. In addition, mithral armor has no maximum Dexterity modifier for AC.  While wearing mithral armor, magic tends to rebound off of you. Once per round, when you are targeted by a line spell or a spell that requires a ranged attack roll, you may roll a d6. On a roll of 5 or 6, you are unaffected by the spell.",
    "armor_cost": "100 × base armor cost.",
    "weapon_effect": "A mithral weapon weighs half as much as it normally would, loses the heavy property if it had it, and gains the finesse property if it didn’t already have it.",
    "weapon_cost": "50 gp + base weapon cost."
  },
  {
    "name": "Silver",
    "description": "The Bürach Empire and the Castinellan Provinces commonly employ silver in arms and armor. Both border Ostoya—a nation ruled by vampires—and thus have perfected silver to combat undead and other horrors. Their blacksmiths produce ceremonial silver armors for officers, inquisitors, and archers who rely on magic or deal with supernatural threats at a distance.  Silver’s magical affinity makes it ideal for enchantment, though it is soft and inferior to steel in a straight fight. Nonetheless, its efficacy against shapechangers and fiends makes it essential in war against Etharis’s monstrous inhabitants.",
    "armor_effect": "Armor made of silver has its base Damage Reduction reduced by 2 (minimum 0). While you wear this Armor, all spells with a duration that are cast on you last twice as long. In addition, creatures with silver sensitivity-such as werewolves and certain devils-make melee attacks against you with disadvantage.  When enchanting silver Armor you can choose to combine two minor enchantments.",
    "armor_cost": "30 × base armor cost.",
    "weapon_effect": "Silvered weapons count as magical. Furthermore silver weapons are known to penetrate the magical hides of certain creatures such as werewolves, fey and many fiends, allowing you to fully damage them in combat.  When enchanting silver weapons you can choose to combine two minor enchantments.",
    "weapon_cost": "10 gp + base weapon cost."
  },
  {
    "name": "Spider Silk",
    "description": "In the Ostoyan Empire, clever aristocrats and vampire nobles have established secret “spider farms” deep under their gothic estates. They harvest giant arachnid silk to craft garments and armors with unmatched softness and resilience. To wear spider silk in Ostoya is to display wealth and status, a subtle declaration of your ties to its dark courts.  Spider silk is a gothic blend of enchanting elegance and tensile strength. Its creation is an artful process, involving alchemical treatments and delicate weaving. The resulting armor is flexible, comfortable, and faintly unnerving, like a beautiful trap waiting to ensnare its prey.",
    "armor_effect": "Spider Silk Armor would be incredibly light and flexible, allowing for easier movement. Your movement speed is increased by 5ft. In addition, so long as you wear the armor and at least 2 limbs are attached to the surface you have Spider Climb. Once a day, you can cast *web*. This feature resets after a long rest.",
    "armor_cost": "200 gp + base armor cost.",
    "weapon_effect": "",
    "weapon_cost": ""
  }
]
