[
  {
    "name": "Aberrant Horror",
    "becoming": "Each Aberrant Horror is defined by one key question: what happened to them? Some individuals make pacts with ancient entities for powers that have unforeseen effects. Others awaken after being defeated by an unnatural monster, surprised that they have been spared, only to feel something writhing in their stomach. Many tropes of body horror can be used as inspiration for an Aberrant Horror. <br><br> Once your origin has been determined, you can consider your motivations regarding the transformation. As their power grows and manifests, they may feel they have lost what makes them fundamentally themselves. Perhaps they take revenge on the entity responsible for their transformation, or perhaps they perceive their transformation as a gift.",
    "features": {
      "prerequisites": {
        "ability_scores": "Constitution 13",
        "acquisition": "You must have had an encounter with an Aberration, magical anomaly, or other plausible reason to have become an Aberrant Horror. Work with your GM to decide how this occurred in your backstory or in-game."
      },
      "save_dc": "8 + your proficiency bonus + your Constitution modifier",
      "level_milestones": [
        "Defeating a powerful Aberration and absorbing its power.",
        "Undergoing a dangerous and costly experiment.",
        "Surviving a magical mishap.",
        "Acquiring the strength to give birth to a more powerful version of yourself, which then consumes your old self.",
        "Fulfilling an eldritch prophecy written in the stars."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Aberrant Adaptations",
            "effect": "Your body can twist and reshape itself as you will, changing body parts into dangerous weapons or useful tools, and regenerating after damage. This ability is represented through Adaptations.<br><br><b>Basic Adaptations</b><br>At 1st level, you gain the following adaptations:<br><br><b>Chitinous Shell.</b> As a bonus action, you can develop a hard, crustacean-like shell. When you use this adaptation and are not wearing heavy armor, you gain a +2 to AC. However, this reduces your speed by 10 feet. This adaptation lasts for 1 minute or until you are knocked unconscious. On your turn, you may use a bonus action to end this adaptation.<br><br><b>Eldritch Limbs.</b> You can transform one or both of your arms into a weapon of thick muscle, sharp claws, or hardened bone. When you make an attack, you can use this adaptation. If you do, you gain the following features:<br><ul><li>You can choose what type of damage your unarmed attacks will cause: Piercing, Bludgeoning, or Slashing. Your arm becomes a claw, tusk, or bone club, depending on the damage type chosen.</li><li>You may roll a d6 in place of normal damage for unarmed strikes.</li><li>You cannot hold any object in the affected arm. This includes, but is not limited to, weapons, shields, and spellcasting focuses. Any object you are holding merges into your adaptation or immediately drops to the ground. The GM may decide if they feel the object is too large to merge.</li></ul>This adaptation lasts until you are knocked unconscious. On your turn, you may use a bonus action to end this adaptation."
          },
          {
            "name": "Aberrant Form",
            "effect": "Your Constitution score increases by 2 and your Strength score increases by 1. An ability score cannot be increased beyond 16 this way.<br><br>You become an Aberration in addition to any other creature types you are. Spells and abilities that affect Aberrations of a specific CR have no effect on you."
          }
        ],
        "flaws": [
          {
            "name": "Unstable Mutations",
            "effect": "Your body becomes malleable and struggles to maintain any one physical shape. Upon completing a long rest, you must roll 1d100 on the Unstable Form table and apply the effects of the result, determined by your transformation level. These effects last until you complete another long rest. If you roll the same result on the table more than once in a row, roll again until a new result is rolled."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Efficient Killer",
            "effect": "When you make an unarmed attack while you are benefiting from the Eldritch Limbs adaptation, you can gain one of the following effects depending on the type of damage you chose:<br><br><b>Piercing.</b> You can launch a razor-sharp barb from your arm. Make a ranged attack at a target within 30 feet. Upon a hit, the target takes piercing damage equal to 2d6 + your Strength modifier.<br><br><b>Bludgeoning.</b> You can manifest a long tentacle, tipped with a hardened bone club. Your unarmed attack deals an additional 1d6 bludgeoning damage. When you hit a creature with an unarmed attack, you can then attempt to damage another creature within 5 feet of the original target. If the original attack roll would hit the second creature, it takes bludgeoning damage equal to 1d6 + your Strength modifier.<br><br><b>Slashing.</b> Your arm forms a row of viciously hooked claws and talons. Your unarmed attack deals an additional 1d6 slashing damage, and the target must succeed at a Constitution saving throw. Upon a failed save, the target gains the bleeding condition for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself upon a success."
          },
          {
            "name": "Other-Worldly Tendrils",
            "effect": "Starting at 2nd level, you can use a bonus action to grow a long, tendril-like appendage out of your body that you are proficient with. On subsequent turns, immediately after taking the attack action, you may use a bonus action to have the tendril attack an enemy within 10 feet of you. If you do, make an unarmed melee attack using your Strength modifier. On a hit, the target takes bludgeoning damage equal to 1d4 + your Strength modifier.<br><br>The tendril lasts until you become unconscious. On your turn, you may use a bonus action to retract it. In addition, you gain the following Adaptations:<br><br><b>Toxic Spray.</b> A lamprey-like mouth opens at the end of a tendril and sprays a noxious toxin. When you attack a creature with one of your tendrils, you can choose to use this Adaptation and forgo dealing damage. If you do, instead of rolling to hit, the target must make a Constitution saving throw against your Transformation Save DC. On a failed save, they become poisoned. A creature that has failed this saving throw makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer affected by this Adaptation.<br><br><b>Constrict.</b> A tendril wraps tightly around the target. When you hit with a tendril attack, and the target is large or smaller, you can choose to use this Adaptation. If you do, the attack deals no damage and the target is grappled. Until the grapple is ended, the tendril cannot be used against other targets.<br><br><b>Hypnotic Trance.</b> A tendril flashes a myriad of coloured bioluminescent lights, attempting to disorient the target. When you attack a creature with one of your tendrils, you can choose to use this Adaptation and forgo dealing damage. If you do, instead of rolling to hit, the target must make a Wisdom saving throw against your Transformation Save DC. On a failed save, all attack rolls against the target have advantage, until the start of the affected creature's next turn. A creature that has failed this saving throw makes another Wisdom saving throw at the end of each of its turns. On a successful save, it is no longer affected by this Adaptation."
          },
          {
            "name": "Situational Evolution",
            "effect": "You can use an action to grow gills and flippers, thin hairs on your extremities to climb walls, or a layer of rapidly-regenerating flesh. You gain the following Adaptations:<br><br><b>Scopulae.</b> Your climbing speed becomes the same as your walking speed. You can climb vertical objects, while leaving one hand free.<br><br><b>Gills and Flippers.</b> Your swim speed becomes the same as your walking speed, and you can breathe underwater.<br><br><b>Regenerative Tissue.</b> At the beginning of your turn, you regain hit points equal to your Constitution modifier if you have no more than half your hit points left. If you take fire or acid damage, then this Adaptation has no effect at the beginning of your next turn.<br><br>These adaptations last until you become unconscious, use a different one of these Adaptations, or use a bonus action on your turn to end the Adaptation."
          },
          {
            "name": "Unearthly Senses",
            "effect": "Starting at 2nd level, you may use a bonus action to enhance your body’s sensory organs, or grow entirely new ones. While this effect is active, you may choose one of the following Adaptations:\n- Keen Senses: You gain advantage on Wisdom (Perception) checks that rely on sight, hearing, or smell.\n- Darkvision: You gain darkvision up to 60 ft, or 120 ft if you already possess darkvision.\n- Third Eye: You can see invisible creatures and objects as if they were visible.\nThese Adaptations last until you become unconscious, use a different one, or end it as a bonus action. At Transformation Level 4, you may choose two of the listed Adaptations instead of one."
          }
        ],
        "flaws": [
          {
            "name": "Hideous Appearance",
            "effect": "Your appearance has grotesquely transformed. You may be a hulking mass of flesh, adorned with countless eyes, or a bone-and-tusk-covered natural weapon. Regardless of your true form, you’re horrific to behold. You can suspend this form and manifest the appearance of the humanoid you once were, but this is taxing and requires concentration. This form is not permanent, and moments of stress are likely to reveal your true nature. Your true form is revealed in the following situations:<br><ul><li>Concentrating on a spell.</li><li>Gaining the unconscious condition.</li><li>Entering hallowed ground.</li><li>Choosing to reveal yourself.</li></ul>In events of extreme emotional or physical stress, a GM may call for a Constitution saving throw with a DC of their choosing to see if you maintain your humanoid form.<br><br>Non-evil creatures that witness your true form become instantly hostile to you, unless the GM decides otherwise."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Wings",
            "effect": "Beginning at 3rd level, you can grow large, twisted wings of mutated flesh. You gain the following Adaptation:<br><br><b>Wings.</b> As a bonus action, you can manifest a pair of distorted, fleshy wings. You gain a fly speed equal to your current speed. These wings recede after 10 minutes. You can reabsorb them as a bonus action on your turn, and they reabsorb automatically if you are knocked unconscious. You can manifest your wings while wearing medium or light armour if it is made to accommodate them. You cannot manifest your wings while wearing heavy armour.<br><br>Once you use this Adaptation, you cannot use it again until you complete a short rest."
          },
          {
            "name": "Additional Tendrils",
            "prerequisite": "Otherworldly Tendrils",
            "effect": "You are able to grow an additional tendril. On subsequent turns, you may use a bonus action to attack with each tendril you have grown. The tendrils can all attack the same target or different ones. Make a separate attack roll for each tendril.<br><br>When you reach the 4th level of this transformation, the number of tendrils you can manifest is increased to three."
          },
          {
            "name": "Enhanced Hypertrophy",
            "effect": "You may roll a d8 in place of normal damage for unarmed strikes. The base damage dice for your adaptations, like Efficient Killer and Otherworldly Tendrils becomes one base die higher. For example, an adaptation that deals 2d6 damage would become 2d8 damage instead."
          },
          {
            "name": "Shifting Form",
            "effect": "Your body has begun to lose its cohesion, softening and shifting like thick jelly. You take no extra damage from critical hits due to the shuffling of your internal organs. Whenever you make a melee or ranged attack using your Eldritch Limbs, you deal an additional 1d6 acid damage. You gain resistance to acid damage."
          }
        ],
        "flaws": [
          {
            "name": "Unstable Existence",
            "effect": "The nature of magic is beginning to unravel your material form. Whenever you roll a natural 1, 2 or 3 on a saving throw against a spell or magical ability, you reveal your Hideous Appearance."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Savage Predator",
            "effect": "Beginning at 4th level, whenever you roll to hit a target and score a natural 20, you may deal an additional 6d6 damage. This damage is the same type as your weapon. In addition, each creature of your choice that is within 30 feet of you must succeed a Wisdom saving throw or become Frightened of you for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
          },
          {
            "name": "Master of the Deep",
            "prerequisite": "Additional Tendrils",
            "effect": "On your turn as an action, you can rapidly grow and launch hundreds of tiny tendrils from your body. Each creature of your choice within 15 feet of you must succeed on a Dexterity saving throw. On a failed save, they suffer one of the following effects of your choice for 1 minute. You can choose different effect options for different creatures:<br><ul><li>Become poisoned.</li><li>Speed becomes 0.</li><li>Attacks against them have advantage.</li></ul>Once you use this feature, you cannot use it again until you complete a short or long rest."
          },
          {
            "name": "Extremophilic Conditioning",
            "effect": "Starting at 4th level, your body has learned to adapt to extreme conditions, allowing you to survive where most would perish. On your turn, as an action, you can use the following Adaptation:<br><br><b>Metamorphosis.</b> You rapidly change your body’s biophysical and chemical composition in reaction to your environment. Choose one of the following options:<br><ul><li>You are resistant to Bludgeoning, Piercing, and Slashing damage. When determining falling damage, you take 1 bludgeoning damage for each 10 feet fallen in place of normal damage (maximum of 20 bludgeoning damage).</li><li>You are resistant to Fire, Lightning, and Acid damage. You are immune to the effects of extreme hot climates.</li><li>You are resistant to Cold, Thunder, and Poison damage. You are immune to the effects of extreme cold climates.</li></ul>This adaptation lasts until you use this Adaptation again."
          },
          {
            "name": "Amorphous Flesh",
            "effect": "Prerequisite: Shifting Form. Your body has dissolved further into a corrosive slurry of flesh and bone similar to an ooze. You are able to move through gaps as narrow as 1 inch wide, and you are immune to the grappled, prone, and restrained conditions. Additionally, whenever you take 10 or more points of bludgeoning, piercing, or slashing damage, you may choose to split into two bodies, each one size smaller, with half of your hit points. Each form may act independently, sharing only one bonus action and one reaction per turn. You may reform into a single body as an action when within 5 ft of each other, regaining hit points equal to your other form’s total. The second body lasts for one hour before dissolving."
          }
        ],
        "flaws": [
          {
            "name": "Entropic Abomination",
            "effect": "The very essence of magic aggravates the unstable nature of your aberrant body.<br><br>Whenever you fail a saving throw to a spell or magical ability, roll on the Unstable Mutation table. If the result is less than your current unstable mutation effect, then replace it with the new result."
          }
        ]
      }
    ]
  },
  {
    "name": "Fey",
    "becoming": "Becoming a fey requires a direct connection to the faerie realms. Most mortals who become fey are stolen as children, transformed rapidly in the faerie realm. Others may strike a bargain with an archfey or swear fealty to a faerie queen. This path is dangerous, requiring wit and awareness to gain the favor of the fey kind.",
    "features": {
      "prerequisites": {
        "ability_scores": "Charisma 13",
        "acquisition": "Swear fealty to a fey court, be raised as a changeling, or have another plausible reason to have become a fey. Must have the GM’s approval for how you achieve this in-game."
      },
      "save_dc": "8 + your proficiency bonus + your Charisma modifier",
      "level_milestones": [
        "Striking a bargain with a greater fey.",
        "Performing a great deed in the name of a faerie queen.",
        "Establishing a new faerie ring or bridge to the fey realms.",
        "Defeating a powerful agent from your rival court.",
        "Earning a domain or title in the realm of faerie."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Fey Form",
            "effect": "Your Charisma increases by 2 and your Dexterity increases by 1. An ability score cannot be raised above 16 in this way. You become a Fey in addition to any other types you are. You are immune to effects that only affect creatures of your former type of a specific CR. Choose a Fey Court (Summer or Winter), which shapes your transformation. <br><br><b>The Summer Court:</b> The summer court embodies the bounty and warmth of the growing season. The fey of summer tend towards joviality, fickleness, and vanity. Creatures of summer often hide their cruel intentions behind beautiful facades. <br><br><b>The Winter Court:</b> The winter court embodies the stillness and darkness of the coldest season. The fey of winter tend to be serious, cruel, and reflective. Creatures of winter are often terrifying to behold but very direct about their intentions."
          },
          {
            "name": "Twilight Step",
            "effect": "As a bonus action, you can teleport up to 30 feet to an unoccupied space. This ability gains an additional effect based on your Fey Court. <br><br><b>Summer:</b> after using Twilight Step, one creature of your choice within 5 feet takes damage equal to your Charisma modifier (minimum 1).<br><br><b>Winter:</b> after using Twilight Step, one creature of your choice within 5 feet takes cold damage equal to your Charisma modifier (minimum 1). Usable a number of times equal to your Charisma modifier (minimum 1), regaining uses on a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Planar Binding",
            "effect": "Your soul is bound to the faerie realms. You have disadvantage on death saving throws as the realm tries to pull you back. If you would die, your soul is taken to a plane of the GM’s choice, and you become an NPC. If you are in the faerie realm responsible for your transformation, this flaw has no effect."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Two-Faced",
            "effect": "You can transform your face into a vision of beauty or horror. Any non-fey creature within 30 feet must make a Wisdom saving throw or be affected for 1 minute. <br><br><b>Summer:</b> on a failed save, the creature is charmed. <br><br><b>Winter:</b> on a failed save, the creature is frightened. The effect ends early if the creature is harmed by you or your allies. <br><br> Once used, you cannot use this feature again until you finish a short or long rest."
          },
          {
            "name": "Sprite Servant",
            "effect": "A fey sprite binds itself to your service. The sprite is a floating ball of light, considered to be a Tiny creature which cannot be harmed or affected in any way. The sprite has the following characteristics:<br><br><ul><li>The sprite has a fly speed of 40 feet.</li><li>The sprite cannot speak verbally, but it can telepathically communicate with you as long as it is within a mile of you. The sprite understands all languages you do.</li><li>The sprite can become invisible at will. Otherwise, it sheds dim light in a 10-foot radius. As a bonus action, you can command the sprite to shine more brightly. When following this command, the sprite can shed bright light in a 20-foot radius and dim light for an additional 20 feet.</li></ul>"
          },
          {
            "name": "Magic Tricks",
            "effect": "Your transformation grants you innate power, which manifests as the ability to cast a small number of spells. You learn one illusion or enchantment cantrip.<br><br>In addition, choose one 1st-level and one 2nd-level illusion or enchantment spell. You can cast each of these spells once without expending a spell slot. You regain the ability to cast them in this way when you finish a short or long rest. Charisma is your spellcasting ability for these spells. When you finish a long rest you can replace your 1st or 2nd level spell with a spell of the same level which must also be an enchantment or illusion spell."
          }
        ],
        "flaws": [
          {
            "name": "Queen’s Command",
            "effect": "The fey court lends you its power, and in exchange you must pay regular tribute. Twice a year, you must provide tribute to your chosen court’s queen. If you fail, you are pulled into her realm for 100 years, or until you strike a bargain to return. Tribute may be treasures, secrets, captives, or other offerings determined by the GM."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Faerie Mantle",
            "effect": "As an action, you can project an aura of majesty for 1 minute. Creatures of your choice within 30 feet must succeed on a Charisma saving throw or be blinded until the end of their turn. They may repeat the saving throw at the end of their turns. Once used, this ability cannot be used again until a long rest."
          },
          {
            "name": "Made of Magic",
            "effect": "You gain resistance to damage from spells. Additionally, you may use a reaction to gain advantage on a saving throw against a spell. Once used, you cannot use this feature again until a short or long rest."
          },
          {
            "name": "Courtly Graces",
            "effect": "You gain proficiency in two skills determined by your court. If you are already proficient in one or both of these skills, then your proficiency bonus is doubled for ability checks using that skill. If you have or ever gain double your proficiency bonus in one or both of these skills, you gain an additional +2 for that skill.<br><br>Additionally, your fealty to a fey court offers you protection from certain emotions associated with the court. You gain a benefit based on your court.<br><br><b>Summer:</b> You gain proficiency in Performance and Persuasion, and you are immune to being charmed.<br><br><b>Winter:</b> You gain proficiency in Deception and Intimidation, and you are immune to being frightened."
          }
        ],
        "flaws": [
          {
            "name": "Bound by Words",
            "effect": "The fey choose their words carefully for they are bound by them, and so too are you. When you give your word to a humanoid creature (such as by making a promise or pledge, entering into a contract, or coming to a verbal agreement) the commitment becomes magically enforced. If you fail to fulfill your part of the agreement, you lose the benefit of all of your fey transformation boons until you surrender an additional tithe to the summer or winter queen, as described in your Queen’s Command flaw. This tithe is in addition to those required by that flaw.<br><br>Importantly, you are bound by the letter of any agreement you make, not by the spirit. If you promise you will not lay a hand on the prince, for example, there would be no consequences if you kicked him (provided your hand didn’t touch him in the process)."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Greater Magic Tricks",
            "prerequisite": "Magic Tricks",
            "effect": "Choose an enchantment or illusion spell of 3rd, 4th, and 5th level. You can cast each of these spells once without expending a spell slot and regain the ability to cast them in this way when you finish a long rest. Charisma is your spellcasting ability for these spells. When you finish a long rest you can replace your 3rd-, 4th-, or 5th-level spell with a spell of the same level, which must also be an enchantment or illusion spell.<br><br>Additionally, you can cast the 1st and 2nd level spells from the Magic Tricks Boon twice per short or long rest."
          },
          {
            "name": "Misdirection",
            "effect": "Light and magic bend strangely around you, making you difficult to hit. All attack rolls against you have disadvantage. If you are hit by an attack, this trait is disrupted until the end of your next turn. This trait only works while you are conscious."
          },
          {
            "name": "Twilight Glamour",
            "effect": "As an action, you can become invisible. Anything you are wearing or carrying on your person is invisible as well. The invisibility ends if you choose to end it, if you attack, or if you cast a spell. Once your invisibility ends in this way, you cannot use this feature again for 1 minute. This trait only works while you are conscious."
          }
        ],
        "flaws": [
          {
            "name": "Seasonally Affected",
            "effect": "Your connection to the fey courts has granted you tremendous power but also an esoteric fragility: you gain a weakness towards cold damage if you are in the summer court, or fire damage if you are in the winter court.<br><br>If you were normally resistant to this damage type, it instead affects you normally. If you are normally immune to damage of that type, you are resistant instead. In addition, whenever you take damage of that type, your maximum hit points are reduced by an equal amount. When your maximum hit points are reduced by this effect, they return to normal after you finish a long rest."
          }
        ]
      }
    ]
  },
  {
    "name": "Fiend",
    "becoming": "A mortal can become a Fiend in a variety of ways. Some forfeit their souls and become one upon death. Others undertake excruciating rituals to transform into one. However, your character becomes a Fiend constitutes their contract. Communicating with your GM about creating deals with mortals in their story is a great way to roleplay your influence within the game world. As a Fiend, you should consider what your character’s motivations are and which NPCs they can use to achieve their goals.",
    "features": {
      "prerequisites": {
        "ability_scores": "Charisma 13",
        "acquisition": "You must have made a pact with a Fiend, undergone an infernal ritual, or have another plausible reason to have become a Fiend. Work with your GM to determine how this happened."
      },
      "save_dc": "8 + your proficiency bonus + your Charisma modifier",
      "level_milestones": [
        "Defeating a greater rival Fiend and taking their place in the hierarchy.",
        "Ensnaring a particularly powerful or influential soul with a contract.",
        "Establishing a cult of worshipers who offer their strength to you.",
        "Establishing a portal between the material plane and the Netherworld.",
        "Killing or corrupting a Seraph."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Entropic Abomination",
            "effect": "The very essence of magic aggravates the unstable nature of your aberrant body.<br><br>Whenever you fail a saving throw to a spell or magical ability, roll on the Unstable Mutation table. If the result is less than your current unstable mutation effect, then replace it with the new result."
          },
          {
            "name": "Gifts of Damnation",
            "effect": "You have acquired the ability to bind your first mortal to your will. You can create a contract to bind their soul to you, feeding on its power. However, you will not gain the benefits of this gift until you have bound a mortal with a contract.<br><br>To bind a mortal’s soul to you and grant them a Gift of Damnation, you must first create a contract for that gift. A contract requires magical ink and paper worth 50gp for each Transformation level you have acquired, and you must meet the prerequisites listed. In addition, you and the mortal must both sign the contract willingly, fully aware of the costs involved. Once signed, Netherworld entities give the benefits of the gift to you, and the mortal receives the named benefit within 7 days. You do not have to provide this benefit yourself. For example, upon signing a contract for a Gift of Unfettered Glory, you will receive the benefits listed under the gift. The mortal who signs will receive glory and no in-game mechanical bonuses, provided by the dubious powers of the Netherworld.<br><br>While you may have any number of contracts in your possession, you can only benefit from one at a time. Upon the completion of a long rest, you may swap the contract you are currently benefiting from for an alternate contract that you have bound a mortal to and signed.<br><br>On your turn, as an action, you can call upon the Netherworld to reveal to you the exact location of a creature that has signed one of your contracts, providing they are on the same plane of existence as you.<br><br>A contract you hold lasts for 7 years or until the mortal that signed it dies. At which point it bursts into flames and you cannot receive any benefits from it."
          },
          {
            "name": "Fiendish Form",
            "effect": "Your Charisma score increases by 2 and your Intelligence score increases by 1. An ability score cannot be increased beyond 16 this way. You become a Fiend in addition to any other creature types you are. Spells and abilities that affect Fiends of a specific CR have no effect on you."
          }
        ],
        "flaws": [
          {
            "name": "Planar Binding",
            "effect": "Your body and soul are bound to a fiendish plane of existence. You have disadvantage on death saving throws as the plane attempts to pull you back to it. If you would be killed, your soul has been dragged back to a plane of existence of the GM’s choice. This plane is your new home, and you become an NPC under the GM’s control.<br><br>If you are on the fiendish plane responsible for your transformation, this flaw has no effect."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Brand of the Chainer’s Gaze",
            "effect": "As a bonus action on your turn, you can brand a creature within 60 feet of you with a fiery mark that diminishes their resolve. The target must make a Wisdom saving throw, and on a failed save they are branded. Whenever a creature branded in this way makes a saving throw, they must roll 1d6 and subtract the result from their saving throw. A creature remains branded this way for 1 minute. The brand disappears if the creature is knocked unconscious, enters hallowed ground, or is targeted by the remove curse spell. You may use this feature a number of times equal to your Charisma modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Brand of the Tyrant’s Hellfire",
            "effect": "As a bonus action on your turn, you can brand a creature within 60 feet of you with a fiery mark that exudes hellfire. The target must make a Charisma saving throw, and on a failed save they are branded. Whenever you hit a creature branded in this way with an attack, you deal an additional 1d6 fire damage.<br><br>A creature remains branded for 1 minute. The brand disappears if the creature is knocked unconscious, enters hallowed ground, or is targeted by the remove curse spell. You may use this feature a number of times equal to your Charisma modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Brand of the Deceiver’s Guile",
            "effect": "As a bonus action on your turn, you can brand a creature within 60 feet of you with a fiery mark that twists their senses and perspective. The target must make an Intelligence saving throw, and on a failed save they are branded. Whenever a creature branded in this way attempts to attack you, they must roll 1d6 and subtract the result from their attack roll.<br><br>A creature remains branded this way for 1 minute. The brand disappears if the creature is knocked unconscious, enters hallowed ground, or is targeted by the remove curse spell. You may use this feature a number of times equal to your Charisma modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Brand of the Slaver’s Leash",
            "effect": "As an action, a flaming whip appears in your hand and lashes out at a creature you can see within 10 feet of you. That creature must make a Dexterity saving throw against your Transformation Save DC. On a failed save, the creature takes 2d4 fire damage and is inflicted with a searing brand. While branded in this way, the creature is tied to you with a wreathing leash of flame and cannot move more than 10 feet away from you. On your turn, you may use a bonus action to drag the creature up to 10 feet in any direction. You may also use your reaction to prevent any event that would take the creature out of range. Spells like misty step or attempts by allies to drag them out fail, though teleportation spells that affect multiple people still function for others. The brand lasts for 1 minute and ends if the creature is knocked unconscious, enters hallowed ground, is targeted by remove curse, or moves more than 10 feet away from you at the end of its turn."
          }
        ],
        "flaws": [
          {
            "name": "Hideous Appearance",
            "effect": "Your appearance has grotesquely transformed. Your skin becomes red and leathery, and vicious horns, teeth and nails erupt through the surface of your skin. You can suppress this form and present the appearance of the humanoid you once were, but this is taxing and requires concentration. Moments of stress are likely to reveal your true nature. In the following situations your true form is revealed:<br><ul><li>Concentrating on a spell.</li><li>Gaining the unconscious condition.</li><li>Entering hallowed ground.</li><li>Choosing to reveal yourself.</li></ul>In events of extreme emotional or physical stress, a GM may call for a Constitution saving throw with a DC of their choosing to see if you maintain your humanoid form.<br><br>Non-evil creatures that witness your true form become instantly hostile to you, unless the GM decides otherwise."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Alluring Deceit",
            "effect": "You gain mastery of deception and hollow promises. You gain proficiency in Deception and Persuasion. If you are already proficient in either of these skills, then your proficiency bonus is doubled for ability checks using that skill.<br><br>This ability has no effect on a skill if the proficiency bonus is already doubled.<br><br>Magic that would determine if you are telling the truth always indicates you are being truthful, and you cannot be magically compelled to tell the truth."
          },
          {
            "name": "Infernal Resistance",
            "effect": "You gain an imposing fortitude, drawing on Netherworld energy. If you would take magical damage from a spell, ability, or weapon, you can use your reaction and take half the amount of damage instead. You cannot use this feature against damage from silvered weapons."
          },
          {
            "name": "Nether Blade",
            "effect": "You can use a bonus action to summon a dreaded Nether Blade. The blade takes the form of a simple or martial weapon that deals slashing damage of your choice. Attacks made with the blade deal fire damage and gain the following features:<br><ul><li>Attacks you make with the blade deal an additional 2d6 fire damage.</li><li>The blade emits flames that create bright light in a 5 foot radius and dim light for an additional 5 feet.</li><li>You cannot be disarmed of the blade.</li></ul>You can unsummon the blade at any time by using an action. If you unwield the blade, it immediately unsummons."
          },
          {
            "name": "Infernal Sub-Contractor",
            "effect": "Your mastery of infernal laws allows you to utilize the benefits of two Gifts of Damnation simultaneously. In addition, you may change gifts on a short rest instead of a long rest."
          }
        ],
        "flaws": [
          {
            "name": "True Name",
            "effect": "Your fiendish transformation is complete, and you are reborn. You must choose a new name for yourself, which becomes your true name. You receive a talisman of brimstone and brass with your true name inscribed in infernal on it. A creature within 10 feet of you that knows your true name, can use an action and speak your true name in an attempt to bind you to their will. If they do, you must make a DC 20 Wisdom saving throw. On a failed save, you become charmed by the creature, and must complete all commands they issue to you to the best of your ability. You remain charmed for 8 hours. If the creature that bound you dies, this effect ends."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Commanding Obedience",
            "effect": "Whenever a hostile creature you can see within 30 feet of you fails a saving throw due to a spell of 1st level or higher that you control, you may command that creature to kneel. On that creature’s turn, it must face you, then kneel and end its turn. While kneeling, the creature is considered prone. If the creature is immune to the prone condition, then the creature just ends its turn."
          },
          {
            "name": "Brimstone Pyrolysis",
            "effect": "When you inflict fire damage against a hostile creature and reduce it to 0 hit points, you can immolate that creature and turn them into a Brimstone Statue.<br><br><b>Brimstone Statue.</b> A Brimstone Statue is the scorched remains of a corpse whose essence has burned out. A Brimstone Statue is the same size as the creature before it died, and uses the following statistics:<br><ul><li>Armour Class: 10</li><li>Hit Points: 10</li><li>Speed: 0</li><li>Damage Immunities: poison, psychic</li></ul>A Brimstone Statue that is reduced to 0 hit points falls apart and is destroyed. It does not detonate.<br><br><b>Detonate.</b> On your turn, as an action, you can detonate one or more Brimstone Statues that you have created. When a Brimstone Statue detonates, it is destroyed, and each creature other than you within 10 feet of the statue must make a Dexterity saving throw. A target takes 3d6 fire damage on a failed save, or half as much damage on a successful one."
          },
          {
            "name": "Infernal Summoning",
            "effect": "On your turn as an action, you can tear open a portal to the Netherworld and summon up to 4 Imps. These Imps are each summoned into their own unoccupied space within 30 feet of you.<br><br>The summoned Imps are friendly to you and your companions. They all act directly after you in the initiative order. They obey any verbal commands that you issue to them (no action required by you). If you don’t issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The Imps disappear in a shower of ash and embers after 1 hour, or if they are reduced to 0 hit points. The GM has the Imps’ statistics.<br><br>Once you use this ability, you cannot use it again until you complete a long rest."
          },
          {
            "name": "Loophole",
            "effect": "You gain insight into summoning spells and how to interfere with them. Whenever you encounter a summoned creature, you are immediately aware it was summoned. As an action, you may wrest control of a summoning spell away from the caster. The spellcaster must make a Wisdom saving throw against your Transformation Save DC. On a failure, you gain control over the spell and any remaining creatures as if you had cast it, including concentration for the remaining duration. You may use this ability a number of times equal to your Charisma modifier (minimum 1), regaining all uses after a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Pull of the Netherworld",
            "effect": "Your new native plane attempts to pull you to it, laying claim to your form. Whenever you roll a natural 1 on a saving throw against a magical spell or ability, you take 1d6 force damage per two character levels in addition to any other damage or effects you would suffer, as your native plane attempts to unbind you from the Material Plane. For example, a 6th level Fighter would take 3d6 force damage. This damage ignores resistances and immunities."
          }
        ]
      }
    ]
  },
  {
    "name": "Giant",
    "becoming": "Few mortals have ever transformed into giants or, more accurately, few mortals have survived the experience. Those who were able to transform had some ancient ancestry that included giants, completed one of a handful of arcane procedures, earned the blessing of a giant high priest, stumbled upon some ancient eldritch giant magic, or a combination of these. Becoming a giant isn’t just about growing in size—it also relies on tapping into the primordial prowess of the giants that allowed them to survive against the wilds when the world was new. <br><br>Growing in strength as a giant often means setting aside planning and reason for instinct and action. Most giants don’t sit around a table plotting the downfall of their enemies; instead, they take the most direct route to their foes and pummel them into submission with their bare hands. Those who show loyalty to their clan, exhibit formidable physical strength, and display decisiveness in war and other contests grow in titanic power.",
    "features": {
      "prerequisites": {
        "ability_scores": "Strength 13",
        "acquisition": "Complete an arcane ritual, consume a giant’s heart stuffed with alchemical compounds and mashed caterpillars, earn the favor of a giant tribe and undergo a ceremony performed by one of their high priests to bestow the gifts of their titanic ancestors upon you, or accidentally stumble upon ancient giant magic."
      },
      "save_dc": "8 + your proficiency bonus + your Strength modifier",
      "level_milestones": [
        "Defeating a creature larger than you.",
        "Intimidating a group of creatures smaller than you into running away or obeying you.",
        "Overcoming a challenge with an extraordinary feat of strength or excessive violence.",
        "Eating a creature the same size as you or larger.",
        "Leading a tribe of giants into battle against another tribe of giants."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Giant Form",
            "effect": "Your Strength score increases by 2 and your Constitution score increases by 1. An ability score cannot be increased beyond 16 in this way. You become a Giant in addition to any other creature types you are. Spells and abilities that affect giants of a specific CR have no effect on you."
          },
          {
            "name": "Growth Spurt",
            "effect": "Your body swells as muscles grow and bones elongate, a painful transformation that ends in a towering stature. If your size is smaller than Large, it is now Large. In addition, your maximum hit points increase by 5 and increase by 5 again each time you gain a new Giant transformation level. Your new larger size does not change your weapon damage."
          }
        ],
        "flaws": [
          {
            "name": "Big Appetite",
            "effect": "As your body has grown, so has your appetite. While you once subsisted on a few pounds of food a day, you now must eat one livestock animal a day to feel nourished. You must eat at least 2 gp, or about 200 lbs., of food each day. You cannot gain the benefits of a long rest on a day where you have not eaten enough food."
          },
          {
            "name": "Heavy Soul",
            "effect": "Your gigantic size extends to your soul as well, making it heavy and burdensome to call back from the beyond. When a creature attempts to return you to life using revivify, raise dead, or a similar spell or effect, it must provide material components worth twice as much as the spell specifies."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Foe Thrower",
            "effect": "When you are grappling a creature, you can use your bonus action to hurl the creature up to 10 feet. If the creature is smaller than you, this distance is increased by 10 feet for each size category it is smaller than you. For example, if you are Large and the target is Medium, you hurl it up to 20 feet. If the creature lands in an unoccupied space, it must succeed on a Dexterity saving throw or fall prone. If the creature lands in a space occupied by another creature or would pass through a space occupied by another creature as part of being thrown, the thrown creature immediately falls prone and the other creature must succeed on a Dexterity saving throw or take 2d6 + your Strength modifier damage and be knocked prone. Increase the damage by 1d6 for each transformation level above 2."
          },
          {
            "name": "Giant’s Strength",
            "effect": "Your Strength score increases by 2, to a maximum of 22. In addition, when you raise your Strength score using an Ability Score Increase feature, you can increase it to a maximum of 22."
          },
          {
            "name": "Titanic Resolve",
            "effect": "When you take damage from a weapon attack, you can use your reaction to shrug off the worst of the harm. When you do, you gain temporary hit points equal to the damage taken from the triggering attack. While you have any temporary hit points granted by this boon, you have resistance to piercing, bludgeoning, and slashing damage. You can use this boon a number of times equal to your Strength modifier (minimum once), regaining all expended uses upon completing a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Groundshaker",
            "effect": "Your steps sound like falling trees and no matter how careful you are, you almost always leave destructive signs of your passing. Creatures have advantage on ability checks made to notice you and follow your trail."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Ferocious Slam",
            "effect": "Your hands sprout jagged growths, visibly pushing through the skin of your knuckles. You can use your fists to make melee weapon attacks as a bonus action. When you hit with your fists, the strike deals 2d6 + your Strength modifier piercing damage instead of the bludgeoning damage normal for an unarmed strike. Once per turn, when you deal damage with your fists, you can immediately expend and roll a Hit Die to magically regain hit points equal to the result of the roll + the damage you dealt with your fists."
          },
          {
            "name": "Mountainous Physique",
            "effect": "You leverage your towering physique for greater feats of athleticism. Your base walking speed increases by 10 feet. In addition, you count as one size larger than you are for the purposes of determining what size creatures you can shove or grapple, your carrying capacity, and the weight you can push, drag, or lift."
          },
          {
            "name": "Titanic Wrath",
            "effect": "When you hit a creature or object with a melee weapon attack, you can channel the wrath of the titans to wreak havoc on your foes. When you do that attack, and all melee weapon attacks you make until the start of your next turn, deal an additional 1d12 damage. You can use this a number of times equal to your Strength modifier (minimum once), regaining all expended uses upon completing a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Boot Quaker",
            "effect": "No matter what your intentions truly are, you can’t help but provoke feelings of fear in smaller creatures. You have disadvantage on Charisma ability checks made against creatures smaller than you, unless you are attempting to intimidate or frighten."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Enormous Size",
            "effect": "You go through another excruciating transformation of flesh and bone that concludes with you nearly doubling in size again. If your size is less than Huge, it is now Huge, and your reach increases by 5 feet. In addition, your maximum hit points increase by 20."
          },
          {
            "name": "Greater Giant’s Strength",
            "effect": "Your Strength score increases by 2, to a maximum of 24. In addition, when you raise your Strength score using an Ability Score Increase feature, you can increase it to a maximum of 24."
          },
          {
            "name": "Swallow Whole",
            "effect": "You can use an action to attempt to ingest a creature within 5 feet that is smaller than you that you have grappled. When you do, the creature must make a Strength saving throw. On a failed saving throw, you swallow the creature whole. A swallowed creature is incapacitated and takes 13 (2d12) acid damage at the start of each of its turns, and it has full cover from all creatures. At the end of a swallowed creature’s turn, it can make a Strength saving throw. On a success, you vomit the creature up into an unoccupied space of its choice within 10 feet of you. You can only have one creature swallowed at a time. You can vomit up a creature you have swallowed into an unoccupied space of your choice within 10 feet as a bonus action on your turn."
          }
        ],
        "flaws": [
          {
            "name": "The Bigger You Are",
            "effect": "Your prodigious size leaves you vulnerable to creatures whose size makes them nearly beneath your notice. Creatures who are at least two size categories smaller than you (Small if you are Large, for example) score critical hits on a roll of 19 or 20 on attack rolls against you."
          }
        ]
      }
    ]
  },
  {
    "name": "Lich",
    "becoming": "Across the Multiverse there are many ways to become a Lich, each determining the type of Lich the mortal becomes. However, within Etharis there is only one type of Lich, as there is only one known method of ascending to Lichdom: The Ritual of Dread. The process of this ritual is a well-guarded secret, entrusted to only a handful of mortals at any one time. The process involves several despicable acts including murder, the brewing of a vile concoction, and even one’s own death. However, it is the process of tearing one’s soul from the body that is most despised, for this process involves the sacrifice of something truly dear to a mortal, and no substitute will be accepted. For some, it is the death of a cherished loved one. For others it is a family legacy. Regardless of the sacrifice, unless the Dreadscape spirits deem it worthy, Lichdom will not be granted.",
    "features": {
      "prerequisites": {
        "ability_scores": "Intelligence 16",
        "acquisition": "You must have the ability to cast 7th-level spells and must complete the Ritual of Dread. This ritual is partially described but intentionally vague so it can be tailored to your setting and campaign. Work with your GM to determine how this occurs."
      },
      "save_dc": "8 + your proficiency bonus + your Intelligence modifier",
      "level_milestones": [
        "Discover ancient and dark arcane knowledge.",
        "Consume the soul of an exceptionally powerful spellcaster.",
        "Build a monument to your power to serve as a giant arcane focus.",
        "Create an army of undead.",
        "Kill a god."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Harvester of Souls",
            "effect": "You have gained the ability to tear the soul out of creatures you kill and consume it for its invigorating effects. Whenever you reduce a creature to 0 hit points, if you are on the same plane of existence as your phylactery, its soul is captured and your phylactery becomes charged.<br><br>On your turn, as an action, you can consume any number of charge levels from your phylactery to regain a single spell slot. When you regain a spell slot in this way, the spell slot’s level is equal to one third of the charge you consumed, rounded down."
          },
          {
            "name": "Undead Form",
            "effect": "Your Intelligence score increases by 4 and your Wisdom score increases by 2. An ability score cannot be increased beyond 22 this way. You become an Undead in addition to any other creature types you are. Spells and abilities that state effects or conditions specifically regarding Undead of a specific CR have no effect on you.<br><br>If a spell or ability other than your own would cause you to gain Hit Points, you gain that many temporary Hit Points instead. If you are reduced to 0 hit points and fall unconscious as a result, any healing you receive will stabilize you and leave you on 1 hit point and unconscious. You stop aging. You are immune to any effect that would age you, and you cannot die from old age. You do not require air, food, drink or sleep."
          }
        ],
        "flaws": [
          {
            "name": "Phylactery",
            "effect": "You have successfully torn your soul from your body and trapped it in a suitable object. The object must be a trinket or item no larger than 1 square foot in size. This item becomes your phylactery.<br><br><b>Phylactery.</b> A phylactery is an enchanted vessel containing a Lich’s soul. Additionally, a phylactery is a conduit for the Lich to feed on captured souls.<br><br>A phylactery has the following statistics:<ul><li>Armour Class: 18</li><li>Hit Points: 90</li><li>Speed: 0</li><li>Damage Immunities: poison, psychic; bludgeoning, piercing, and slashing from non-magical sources.</li><li>Damage Resistances: necrotic, cold, thunder, lightning, force, fire.</li></ul>While a soul is stored in your phylactery, the phylactery is considered charged. Its charge level is equal to the CR of all the creatures whose soul you have captured. To store a new soul in your Phylactery, add the CR of the creature you killed to your Phylactery’s charge level. The souls of creatures with a CR of less than 1/4 are not great enough to charge your phylactery. Your Phylactery’s charge level cannot exceed 27.<br><br>If your phylactery is reduced to 0 hit points, your soul is lost; you crumble to dust and are killed outright.<br><br>If you are killed and you control a charged phylactery on the same plane of existence, your phylactery’s charge is consumed and your body is reconstructed within 5 feet of your phylactery 7 days later. If you are killed and your Phylactery does not have a level of charge, you are reanimated 7 days later as a Demilich under the GM’s control.<br><br>This ability cannot be used when you kill a construct, undead, or any creature without a soul. The following are the effects caused when you use this ability:<br><b>Fire.</b> The target is vaporised into a cloud of ash and smoke. The space the creature died in, and each space within 5 feet of it, are considered heavily obscured for 1 minute. Winds of moderate or greater speeds (at least 10 miles per hour) also disperse the cloud.<br><b>Necrotic.</b> As the soul of your enemy leaves their body, you are able to siphon off part of their life force. You regain hit points equal to your Intelligence modifier (minimum of 1), plus your character level.<br><b>Poison.</b> Target a creature within 10 feet of the killed creature. That creature must succeed on a Constitution saving throw or gain the poisoned condition for 1 minute."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Puppet Master",
            "effect": "Undead creatures of CR 1 or less that you animate with spells or abilities become permanently under your control. In addition, other creatures cannot gain control of undead creatures you raised."
          },
          {
            "name": "Lichdom of the Arcane",
            "effect": "Whenever you kill any creature with a spell, you may apply an additional effect depending on the damage dealt. Any effects with range are centred on or measured from the killed target, and if required, use your Transformation save DC."
          },
          {
            "name": "Rift to the Dreadscapes",
            "effect": "You gain the ability to open a rift to the Dreadscapes. As an action on your turn, you can choose a point within 5 feet of you to open the rift. Once opened, the rift stretches out from that point to a 20-foot-radius sphere. When a creature other than you enters the rift’s area for the first time on its turn, or starts its turn there, it must make a Constitution saving throw against your Transformation DC. On a failed save, the creature suffers 10d10 necrotic damage, or half as much on a successful save. Undead creatures are immune to damage from this ability. The rift remains open for 1 minute, but closes if you become unconscious. Once you use this ability, you cannot use it again until you complete a long rest."
          },
          {
            "name": "Phylactery Bond",
            "level": 2,
            "effect": "You share an especially strong bond with your phylactery and gain benefits from keeping it on your person. You may choose to craft your phylactery into an amulet, a ring, a brooch, or some other form of jewelry. When you finish a short or long rest and you are wearing your phylactery, you may choose a damage type other than radiant damage. As long as you wear your phylactery, you have immunity to that damage type. In addition, your phylactery is more resilient than normal. Your phylactery’s AC becomes 20 and its hit points increase to 120. Your phylactery’s nature is hidden from casual observation, and an observer must make an Intelligence (Arcana) check against your Transformation Save DC in order to identify your phylactery."
          }
        ],
        "flaws": [
          {
            "name": "Rift to the Dreadscapes",
            "effect": "You gain the ability to open a rift to the Dreadscapes. As an action on your turn, you can choose a point within 5 feet of you to open the rift. Once opened, the rift stretches out from that point to a 20-foot-radius sphere. When a creature other than you enters the rift’s area for the first time on its turn, or starts its turn there, it must make a Constitution saving throw against your Transformation DC. On a failed save, the creature suffers 10d10 necrotic damage, or half as much on a successful save. Undead creatures are immune to damage from this ability. The rift remains open for 1 minute, but closes if you become unconscious. Once you use this ability, you cannot use it again until you complete a long rest."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Relentless Undead",
            "effect": "Whenever an undead creature you control is reduced to 0 hit points, it may immediately move up to its full speed and make an attack action before dying. This feature has no effect if the creature has been reduced to 0 hit points by radiant damage."
          },
          {
            "name": "Arcane Supremacy",
            "effect": "You become an exemplar of arcane power. When you cast a concentration spell, if you are already concentrating on one concentration spell, you do not lose concentration of that spell; instead you gain one level of exhaustion. If you are already concentrating on more than one spell, this feature has no effect. If you cast a third concentration spell during this time, you lose concentration on one of the two spells. Once you use this feature you cannot use it again until you complete a long rest."
          },
          {
            "name": "Staff of the Dreadscapes",
            "effect": "Starting at 3rd level, you can use an action to summon a deathly staff made of blackened bone and twisted rootwood. The staff is the same as a quarterstaff, with the following features:<ul><li>Necrotic damage dealt by you ignores resistance to necrotic damage.</li><li>Your Spell Save DC and Transformation DC are both increased by 2.</li><li>Food and non-creature plants the staff touches wither and decay.</li></ul>You can unsummon the staff at any time with the use of an action. If you un-wield the staff, it immediately unsummons."
          },
          {
            "name": "Enhanced Phylactery",
            "level": 3,
            "effect": "Your bond with your phylactery strengthens, granting additional benefits: • If you aren’t wearing armor, your base Armor Class is 15 + your Dexterity modifier. Your phylactery’s AC is increased by 2. • Your spell save DC and spell attack bonus each increase by 2. • You and your phylactery have advantage on saving throws against spells and other magical effects."
          }
        ],
        "flaws": [
          {
            "name": "Necromantic Dystrophy",
            "effect": "Your body has become dependent on consuming souls, otherwise it becomes withered and frail. If you go more than 24 hours without converting 4 CR worth of souls from your Phylactery into spell slots you gain the following effects:<ul><li>You cannot use the dash, dodge, or disengage actions. You cannot use these actions as bonus actions.</li><li>You cannot use your reaction to make opportunity attacks.</li><li>You cannot disguise your hideous form feature.</li></ul>Upon converting the required amount of souls into spell slots, you are no longer affected by the aforementioned effects."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Lord of Undeath",
            "effect": "Whenever you reduce a humanoid to 0 hit points, you can choose to reanimate it. If you do, the creature rises at the beginning of its next turn as a zombie permanently under your control, following verbal commands to the best of its ability."
          },
          {
            "name": "Arcane Omniscience",
            "effect": "You have mastered the arcane arts. You know every spell from the wizard’s spell list and can prepare a number of these equal to your Intelligence modifier. Spells prepared this way do not count towards the maximum number of spells you can prepare. Upon completing a short rest, you can change one or more of these prepared spells for another spell from the wizard’s spell list."
          },
          {
            "name": "Deathly Being",
            "effect": "You become immune to poison damage, as well as bludgeoning, piercing, and slashing damage from non-magical attacks. In addition, you cannot become charmed, poisoned, paralysed, or frightened."
          },
          {
            "name": "Soul Reflection",
            "level": 4,
            "effect": "You have learned to utilize your bond with your phylactery to its greatest effect. While wearing your phylactery, whenever you are targeted by a spell, if you are the only target, you can use your reaction and spend charges from your phylactery equal to the spell’s level. If you do so, the spell reflects and instead targets an appropriate target of your choice within range of the spell as if you cast it. For the purpose of using this feature, cantrips are considered 1st-level spells."
          }
        ],
        "flaws": [
          {
            "name": "Weight of Ages",
            "effect": "The weight of time is degrading for your Lich form and only the consumption of many souls can stay its effects. If you go more than 24 hours without converting 8 CR worth of soul from your Phylactery into spell slots you gain the following effects:<ul><li>You cannot use the attack action.</li><li>If you move on your turn, you cannot use a bonus action or reaction until your next turn.</li><li>If you use a bonus action on your turn, your speed becomes 0 until your next turn.</li></ul>Upon converting the required amount of souls into spell slots, you are no longer affected by the aforementioned effects."
          }
        ]
      }
    ]
  },
  {
    "name": "Lycanthrope",
    "becoming": "In Etharis, there are two documented methods of contracting the Lycanthropic curse. The first is being bitten by a Lycanthrope and not curing the curse before it takes hold. The second is to complete a druidic ritual known as the Lunar Sacrament. Once you have become a Lycanthrope, consider how your character feels about the curse. Do they wish to cure it before it progresses too far? Do they wish to understand it and make peace with the beast that resides within?",
    "features": {
      "prerequisites": {
        "ability_scores": "Strength 13",
        "acquisition": "You must have contracted the Curse of Lycanthropy, usually by being bitten by a Lycanthrope and surviving, or by completing the Lunar Sacrament and being imbued with Lycanthropy. Work with your GM to decide how this occurs."
      },
      "save_dc": "8 + your proficiency bonus + your Strength modifier",
      "level_milestones": [
        "Establishing a pack of other Lycanthropes.",
        "Killing an Alpha Lycanthrope.",
        "Gaining control of your animalistic urges.",
        "Unleashing the beast within and losing your humanity."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Hybrid Transformation",
            "effect": "As an action, you may transform into a monstrous hybrid: half-beast, half-sentient. While in your hybrid form, the following rules apply:<ul><li>You can’t cast spells or concentrate on spells. Your ability to speak is reduced to short, basic, guttural responses.</li><li>Your stats remain the same as your humanoid stats.</li><li>Any armour you are wearing merges into your Hybrid Form or immediately drops to the ground. The GM may decide if they feel the armour is too large to merge.</li><li>While transformed and not wearing any armour or using a shield, your AC equals 10 + your Constitution modifier + your Dexterity modifier.</li><li>While transformed you can use weapons and equipment as normal, unless specified elsewhere.</li><li>You roll a d6 in place of the normal damage for your unarmed strikes. Attacks using your claws deal slashing damage instead of bludgeoning damage.</li><li>When making the attack action you may substitute one attack to make an unarmed bite attack. If the attack hits, you deal piercing damage equal to 1d8 + your Strength modifier. If you make a bite attack, you cannot make another until the beginning of your next turn.</li><li>If you made the attack action, as a bonus action you may make an unarmed claw attack or bite attack, provided you have not already used your bonus action.</li></ul>Your hybrid form lasts for a number of hours equal to your Constitution modifier (minimum of 1) and ends early if you are knocked unconscious or reduced to 0 hit points. You can end your Hybrid Form by using an action on your turn."
          },
          {
            "name": "Shapechanger’s Form",
            "effect": "Your Strength score increases by 2 and your Constitution score increases by 1. An ability score cannot be increased beyond 16 this way.<br><br>You become a Shapechanger in addition to any other creature types you are. Spells and abilities that affect Shapechangers of a specific CR have no effect on you."
          }
        ],
        "flaws": [
          {
            "name": "Lust for the Hunt",
            "effect": "The savage nature of your curse sometimes causes you to lose control. These ferocious tendencies are a constant struggle between you as a humanoid and the beast within. When you are in your hybrid form, you must succeed at a DC 10 Wisdom saving throw at the beginning of each turn or lose control. If you are in the light of a full moon, you automatically fail this saving throw. If you fail this saving throw, you are subjected to the following until you succeed:<ul><li>You must move toward the closest non-player creature you can see, smell or hear, prioritising helpless creatures. If you end your movement and no non-player creature is within 5 feet of you, then you must use your action to dash toward one.</li><li>If there is a non-player creature within 5 feet of you and you have not used your action, you must make a melee attack against it, prioritising helpless creatures.</li><li>If you made a melee attack against a creature, and that creature is still alive, then you must use your bonus action to make an unarmed claw or bite attack against the same creature.</li></ul>Additionally, if you are subjected to the light of a full moon you must succeed at a DC 20 Wisdom saving throw or automatically turn into your hybrid form and cannot transform back until dawn. If you succeed in this saving throw, you are immune to its effects for 24 hours."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Iron Pelt",
            "effect": "While in hybrid form, you have resistance to bludgeoning, piercing, and slashing damage from non-silvered, non-magical sources."
          },
          {
            "name": "Hunter’s Howl",
            "effect": "While in your hybrid form, you can use a bonus action to let out a loud howl and mark a creature within 60 feet as your prey. A creature remains marked this way for 1 hour, or until it dies. While a creature is marked as your prey, you gain the following benefits:<ul><li>Whenever you hit the marked creature with a melee attack, you deal an additional 1d6 damage. This damage is the same type as the attack.</li><li>You have advantage on any Wisdom (Perception) or Wisdom (Survival) check you make to track your prey.</li></ul>You may use this feature a number of times equal to your Strength modifier (minimum of 1). You regain all expended uses of this feature upon a short or long rest."
          },
          {
            "name": "Kindred Form",
            "effect": "You gain the ability to transform into the animal form representative of your Lycanthropy type, known as your Kindred Form. You follow the same rules as the Hybrid Transformation feature and any feature that specifies the hybrid transformation, unless specified otherwise. You can only transform into the kindred form representative of your Lycanthropy. Each Kindred Form gains the following rules:<ul><li>You cannot speak.</li><li>You cannot take any actions requiring hands, except your Transformation capabilities.</li><li>You can only use unarmed claw and bite attacks.</li><li>You automatically succeed at all saving throws relating to the Lust for the Hunt flaw.</li></ul>Other than being larger, you are indistinguishable from a regular animal of your Kindred Form."
          },
          {
            "name": "Kindred Form - Bear",
            "effect": "Your kindred form takes the shape of a large bear. While in your kindred form, you gain the additional features:<br><br>- You can speak to and understand other bears.<br>- When you make any saving throw, you can add your Constitution modifier to the result.<br>- Your hit point maximum increases by 15 hit points."
          },
          {
            "name": "Kindred Form - Wolf",
            "effect": "Your kindred form takes the shape of a ferocious dire wolf. While in your kindred form, you gain the additional features:<br><br>- You can speak to and understand other wolves.<br>- When making an attack against a creature, if an ally is within 5 feet of that creature and not incapacitated, you have advantage on that attack roll.<br>- Your speed increases by 20 feet, to a maximum of 60."
          },
          {
            "name": "Heart of the Wild",
            "effect": "The spirits of nature speak to you through your bestial side, offering you guidance and knowledge. You may now cast and concentrate on spells in hybrid form. Additionally, you can speak, read, and write Sylvan, and you have advantage on Wisdom and Charisma checks to interact with fey and beasts."
          }
        ],
        "flaws": [
          {
            "name": "Silver Sensitivity",
            "effect": "You have developed a debilitating sensitivity to silver. While in your Hybrid or Kindred form, you have vulnerability to silvered weapons. In addition, you cannot have resistance to attacks made with a silvered weapon."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Titanic Vigor",
            "effect": "Your hit point maximum increases by an amount equal to twice your character level, and it increases by 2 every time you gain a character level.<br><br>Additionally, when in your hybrid form, you gain 5 temporary hit points at the start of your turn."
          },
          {
            "name": "Predatory Leap",
            "effect": "Your jump distance is doubled.<br><br>In addition, in hybrid form, if you jumped more than 5 feet and land within 5 feet of a creature, you can immediately take the attack action to attack that creature. On a hit, the target must make a Strength saving throw or become prone on a failed save. You can decide to automatically grapple the target if they fail their save."
          },
          {
            "name": "Bestial Savagery",
            "effect": "You have embraced the animalistic side of your transformation. While in your Hybrid Form, you gain the following benefits:<br><br>- Your unarmed attacks deal 1d8 slashing damage and are considered magic attacks.<br>- Your AC increases by 1.<br>- You are immune to the charmed and frightened conditions."
          },
          {
            "name": "Call the Pack",
            "prerequisite": "Hunter’s Howl",
            "effect": "When you use your Hunter’s Howl ability, up to three allies you designate within 60 feet of the target also gain the benefits. Your Hunter’s Howl also grants those allies advantage on attack rolls against the target if another affected ally is within 5 feet of the creature and not incapacitated. Additionally, when a hostile creature afflicted by your Hunter’s Howl dies, you regain hit points equal to twice your Strength modifier."
          }
        ],
        "flaws": [
          {
            "name": "Fraying Memories",
            "effect": "You have begun to suffer the effects of sharing a mind with two personalities. Memories of less practical significance have been lost to new tones of midnight hunts. You have disadvantage on Intelligence ability and skill checks recalling information or knowledge."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Unstoppable Rage",
            "effect": "You have become a visage of unkillable carnage and slaughter even other Lycanthropes fear. When you are reduced to 0 hit points and you are not killed outright, you are not knocked unconscious. You can take your future turns as though you were not at 0 hit points and are affected by all spells, abilities and features as normal. While you have 0 hit points, taking damage causes death saving throw failures as normal, and three death saving throw failures can still kill you."
          },
          {
            "name": "Savage Instincts",
            "effect": "You have developed an unrelenting thirst for bloodshed and carnage. While in your hybrid form, if you hit a creature with an unarmed attack, and it is missing any of its hitpoints, the base damage die is increased to 1d12."
          },
          {
            "name": "Kindred Affinity",
            "prerequisite": "Kindred Form Transformation feature",
            "effect": "You have reached true harmony with your Kindred Form, achieving a state of peace most Lycanthropes never find. You gain the following benefits while in your Kindred Form:<br><br>- You can speak.<br>- You can cast spells without needing to provide their verbal or somatic components. Additionally, you can cast spells without needing to provide material components, provided they do not have a gold cost.<br>- Friendly creatures within 20 feet of you have advantage on Wisdom ability checks and saving throws."
          },
          {
            "name": "Blood Frenzy",
            "prerequisite": "Bestial Savagery",
            "effect": "Your bite attack damage increases to 2d8. If you hit a creature with a bite attack, you can force the creature to make a Strength saving throw against your Transformation Save DC or be grappled. While the target is grappled in this way, you have advantage on attack rolls against them and deal additional damage with your natural weapons equal to your Strength modifier."
          }
        ],
        "flaws": [
          {
            "name": "Predatory Nature",
            "effect": "You have begun to realise the true cost of your transformation. The beast within has gained more control of your body than you have. While you can control it at times you know it cannot be contained forever, and when it breaks free, it will delight in any slaughter it can find. You gain the following features:<br><br>- If you can see, hear or smell a helpless creature, you gain disadvantage on all Wisdom saving throws.<br>- At the beginning of your turn, if you can see, hear or smell a hostile or helpless non-player creature, you must succeed a DC 10 Wisdom saving throw or be transformed into your Hybrid Form. If you succeed this saving throw, you become immune to this effect until dawn.<br>- Whenever you kill a creature and you are in your Hybrid Form, you cannot transform back into your humanoid form until dawn the next day. Although you can transform into your Kindred Form."
          }
        ]
      }
    ]
  },
  {
    "name": "Primordial",
    "becoming": "There are several ways for a mortal to consume a primordial spark, but continuing to become an elemental takes concentrated effort. A mortal might be born with an elemental spark, gifted one, or they could gain one by consuming the power of an elemental. Once acquired, one must spend a great deal of time contemplating and understanding the spark to unlock its full potential. The process of attaining elemental mastery is dangerous. The slightest slip in control can cause devastation on a massive scale. Such facts are why isolated individuals like druids, monks, or rangers are most likely to see the transformation through to its end.",
    "features": {
      "prerequisites": {
        "ability_scores": "Constitution 13 or higher",
        "acquisition": "Through ritual, defeating a greater Elemental being, or by some other means, you must consume a Primordial Spark."
      },
      "save_dc": "8 + your proficiency bonus + your Constitution modifier",
      "level_milestones": [
        "Defeat and absorb the power of a greater elemental",
        "Claim an elemental node",
        "Make an alliance with a being from one of the elemental planes",
        "Use your powers to defeat an encroaching civilization",
        "Free an imprisoned or indentured elemental creature"
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Elemental Form",
            "effect": "Your Constitution increases by 2 and your Wisdom score increases by 1. An ability score cannot be increased beyond 16 in this way. You become an Elemental in addition to any other creature types you are. Spells and abilities that affect Elementals of a specific CR do not affect you."
          },
          {
            "name": "Primordial Affinity",
            "effect": "While able to control all elements, your Primordial birth was sparked by one particular element; your Primordial Affinity. Your body is infused with malleable elemental energy. You must choose an element below and gain all the benefits of that element:\n\nAir. You have resistance to lightning damage. In addition, you can channel the air currents around you to guide a ranged attack. Once on each of your turns, when you make a ranged weapon or ranged spell attack, you can make that attack with advantage.\n\nEarth. You have resistance to poison damage. In addition, whenever you gain temporary hit points, you gain that many plus your proficiency bonus instead.\n\nFire. You have resistance to fire damage. In addition, whenever you deal fire damage, you can add your Constitution modifier to the damage dealt.\n\nWater. You have resistance to cold damage. In addition, whenever a creature regains hit points due to a spell or feature you control, you can imbue them with healing elemental energy. The creature regains additional 1d6 hit points. Only one creature who regains hit points from the spell or feature can benefit from this."
          }
        ],
        "flaws": [
          {
            "name": "Planar Binding",
            "effect": "Your body and soul are bound to a primordial plane of existence. You have disadvantage on death saving throws as the plane attempts to pull you back to it. If you would be killed, your soul is taken back to a plane of existence of the GM’s choice. This plane is your new home, and you become an NPC under the GM’s control. If you are on the primordial plane responsible for your transformation, this flaw has no effect."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Dual Nature",
            "effect": "You can choose to add a second elemental source from the Primordial Affinity Boon to add to your form. When you do so, you gain the associated benefits of your new element."
          },
          {
            "name": "Elemental Surge",
            "effect": "You can channel pure elemental energy into a concentrated bolt of an element of your choice. On your turn, as an action you can choose one of the below choices:\n\nLightning Strike. You can make a special ranged attack targeting a creature within 60 feet. You are proficient with this attack, which uses your Constitution modifier. On a hit, this attack deals 3d8 + your Constitution modifier lightning damage. You can then use a bonus action to target another creature within 30 feet of the first target with the same attack. Increase the damage by 1d8 for each transformation level above 2.\n\nEarth Shard. You can force a creature within 30 feet to make a Constitution saving throw. On a failed save, the creature takes bludgeoning damage equal to 3d6 + your Constitution modifier, or half as much on a successful save. Increase the damage by 1d6 for each transformation level above 2. You also gain temporary hit points equal to half the damage dealt.\n\nFlame Wave. Each creature in a 15-foot cone originating in your square must make a Dexterity saving throw. On a failed save, creatures in the area take fire damage equal to 2d8 + your Constitution modifier. Increase the damage by 1d8 for each transformation level above 2.\n\nAquatic Rejuvenation. Choose a creature you can see within 60 feet of you. The creature regains a number of hit points equal to 2d8 + your Constitution modifier. Increase the amount of hit points regained by 1d8 for each transformation level above 2.\n\nYou can use these features a number of times equal to your Constitution modifier, regaining all expended uses upon completing a long rest."
          },
          {
            "name": "Call the Four",
            "effect": "You can use your action to summon or repel elemental forces around you, causing one of the following effects of your choice: • You create a 15-foot radius globe of breathable air around you. Creatures can pass freely in or out of the globe, but other elemental forces like water or fire cannot. Alternatively, you can choose to banish all air from inside the globe. This globe lasts for 10 minutes, and you must concentrate on it (as per concentrating to maintain a spell). • You can conjure up to 50 pounds of loose earth at a point within 30 feet of you. Alternatively, you can shape the earth and stone within 15 feet of you. If affecting dirt or stone on the ground, you can cause it to become difficult terrain. • All flammable objects not worn or wielded within 30 feet of you to burst into flame for 1 minute. Alternatively, all nonmagical flames within 30 feet of you are immediately extinguished. • You can conjure up to 10 gallons of water at a point within 30 feet of you or cause the water to fall like rain in a 30-foot area for 1 minute. Alternatively, you can choose to repel water within 15 feet of you. This ability has no effect on living creatures but repels mist, rain and creates pockets of air if submerged in water."
          }
        ],
        "flaws": [
          {
            "name": "Elemental Appearance",
            "effect": "Your appearance has grotesquely transformed. Your eyes might be smoldering embers, water could continuously pour from your mouth or nose, your extremities may crumble like sand, or patches of your skin might fade to transparency. Regardless of your true form, you are horrific to behold. You can suspend this form and manifest the appearance of the humanoid you once were, but this is taxing and requires concentration. This form is not permanent, and moments of stress are likely to reveal your true nature. Your true form is revealed in the following situations: • Concentrating on a spell. • Gaining the unconscious condition. • Choosing to reveal yourself. • In events of extreme emotional or physical stress, a GM may call for a Constitution saving throw with a DC of their choosing to see if you maintain your humanoid form. Non-chaotic creatures that witness your true form become hostile to you, unless the GM decides otherwise."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Primeval Body",
            "effect": "Your transformation to an elemental form has changed your body entirely. You no longer need to sleep, breathe, or eat. You also gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."
          },
          {
            "name": "Aura of Awakening",
            "effect": "You emit an aura of power that awakens the elemental forces in your companions. When you first gain this feature, choose one of the options below. You may change the aura you emit upon completing a long rest. • Light as Air. Whenever you or a friendly creature within 10 feet of you makes a Dexterity saving throw, the creature gains a bonus equal to your Constitution modifier. You must be conscious to grant this bonus. • Forged in Fire. While you are conscious, whenever you or a friendly creature within 10 feet of you deals damage with a melee weapon attack, they deal additional fire damage equal to your Constitution modifier. You must be conscious to grant this bonus. • Heart of Stone. At the beginning of your turn, you and each creature of your choice within 10 feet of you gain temporary hit points equal to your Constitution modifier. While a creature has temporary hit points gained in this manner and are not incapacitated, they cannot be moved or knocked prone, unless they choose to be. You must be conscious to grant this bonus. • Spring of Life. Each unconscious, non-sleeping creature of your choice within 10 feet of you regains 1 hit point at the beginning of their turn. You must be conscious to grant this bonus."
          },
          {
            "name": "Master of Many",
            "effect": "You can choose to add a third elemental source to your form. When you do so, you gain the associated benefits of your new element from Primordial Affinity in addition to your current source benefits."
          }
        ],
        "flaws": [
          {
            "name": "Force of Nature",
            "effect": "You are losing your connection to societal norms. The needs of civilization, community, and morals pale in comparison to the elemental chaos roiling within you. Whenever you complete a long rest, if you are within civilization, you do not regain any hit dice or lose any levels of exhaustion. In these circumstances, the GM decides if a location is considered civilized or not. Alternatively, the GM can decide that a park or grove within a city is sufficient."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Potent Aura",
            "effect": "Creatures of your choice within 10 feet of you gain resistance to lightning, fire, poison, and cold damage."
          },
          {
            "name": "Energy Flow",
            "effect": "As a bonus action, you can burst into a shower of elemental material then materialize somewhere else. You magically teleport up to 30 feet to an unoccupied space you can see, along with any equipment you are wearing or carrying. Moving in this way does not provoke opportunity attacks. After teleporting, you can choose one of the following: Swift Assault: Immediately make a weapon attack. If ranged, no disadvantage if hostile creature is within 5 feet. Spark Storm: Each creature within 10 feet must make a Dexterity saving throw or take 2d6 fire damage. Boulderous Hide: Gain resistance to a damage type until the start of your next turn. Sea Mother’s Tether: A thin tether of water links you to a creature within 30 feet for 1 minute. While tethered, if the linked creature would take damage, you can choose to take that damage instead. This damage cannot be reduced or prevented in any way. You can use this ability a number of times equal to your Constitution modifier, regaining all uses at the end of a long rest."
          },
          {
            "name": "Elemental Mastery",
            "effect": "You gain the fourth elemental source to your form. You gain the associated benefits of your new element from Primordial Affinity. Additionally, you can summon the four elements to wreath you in power. When a creature hits you with a melee attack, you can use your reaction to force it to make a Dexterity saving throw, taking 8d6 damage of your choice from cold, fire, lightning, or bludgeoning, or half as much on success. Until the end of your following turn, your Primordial Affinity feature has one of the following additions: Air: Advantage on all ranged weapon and ranged spell attacks. Earth: Gain temporary hit points equal to your character level at the beginning of your turn. Fire: Each creature of your choice within 5 feet of you takes 2d6 fire damage at the beginning of your turn. Water: Whenever a creature regains hit points due to a spell or feature you control, they regain an additional number of hit points equal to your character level. You can use this feature a number of times equal to your Constitution modifier, regaining all uses upon completing a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Pull of Chaos",
            "effect": "Your new native plane attempts to pull you to it, laying claim to your form. Whenever you roll a natural 1 on a saving throw against a magical spell or ability, you take 1d6 force damage per two character levels in addition to any other effects. Your native plane attempts to unbind you from the Material Plane. For example, a 6th-level character would take 3d6 force damage. This damage ignores resistances and immunities."
          }
        ]
      }
    ]
  },
  {
    "name": "Seraph",
    "becoming": "To be chosen by an Arch Seraph is to become a vessel for the principles they uphold. This is a charge not to be taken lightly, and those who display righteousness with the intention of becoming a Seraph are usually overlooked for this reason. When becoming a Seraph, consider why your character was chosen. Do you display hidden merit? Are you devoted to a cause they will value?",
    "features": {
      "prerequisites": {
        "ability_scores": "Wisdom 13",
        "acquisition": "You must have been exalted by an Arch Seraph, divine cosmic energies, or have another plausible reason to have become a Seraph. Work with your GM to decide how this occurs."
      },
      "save_dc": "8 + your proficiency bonus + your Wisdom modifier",
      "level_milestones": [
        "Defeating a powerful force of darkness.",
        "Create a hallowed landmark for pilgrims.",
        "Establish a parish of worshipers who uphold your virtue.",
        "Establish a portal between the Material Plane and the Empyrium.",
        "Redeem a soul that was considered beyond redemption."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Celestial Form",
            "effect": "Your Wisdom score increases by 2 and your Constitution score increases by 1. An ability score cannot be increased beyond 16 this way. You become a Celestial in addition to any other creature types you are. Spells and abilities that affect Celestials of a specific CR have no effect on you."
          },
          {
            "name": "Angelic Wings",
            "effect": "You have manifested feathered wings. You have a flying speed equal to your normal speed. You cannot wear armour or clothing that has not been modified to accommodate your wings."
          }
        ],
        "flaws": [
          {
            "name": "Planar Binding",
            "effect": "Your body and soul are bound to a divine plane of existence. You have disadvantage on death saving throws as the plane attempts to pull you back to it. If you would be killed, your soul has been taken back to a plane of existence of the GM’s choice. This plane is your new home, and you become an NPC under the GM’s control. If you are on the divine plane responsible for your transformation, this flaw has no effect."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Divine Retribution",
            "effect": "When you or an allied creature you can see within 30 feet takes the attack action, you can use your reaction to imbue them with holy zeal. Immediately after the target completes the attack action, they can make an additional attack as a bonus action. On a hit, the hit target takes an additional 1d8 radiant damage. You may use this feature a number of times equal to your Wisdom modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Divine Clemency",
            "effect": "When you or a creature you can see within 60 feet takes damage, you can use your reaction to cast a spell of 1st level or higher. This spell must target the damaged creature and restore hit points to it. You may use this feature a number of times equal to your Wisdom modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Divine Expedition",
            "effect": "At the beginning of another creature’s turn, you can use your reaction to move yourself up to your speed or allow an ally that you can see, within 60 feet, to move up to their speed. Movement made this way does not cause attacks of opportunity. You may use this feature a number of times equal to your Wisdom modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          },
          {
            "name": "Divine Protection",
            "effect": "When you or an allied creature you can see within 30 feet is targeted by an attack, you can use your reaction to shield them with holy light. The target gains a +4 bonus to AC against the attack. You may use this feature a number of times equal to your Wisdom modifier (minimum of 1). You regain all uses of this feature when you finish a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Divine Appearance",
            "effect": "Your appearance has radically transformed. Your body radiates a divine glow, while your wings are prominent and powerful appendages. You can contain this form and present the appearance of the humanoid you once were, but this is taxing and requires concentration. Moments of stress are likely to reveal your true nature. In the following situations, your true form is revealed: Concentrating on a spell. Gaining the unconscious condition. Entering desecrated ground. Choosing to reveal yourself. In events of extreme emotional or physical stress, a GM may call for a Constitution saving throw with a DC of their choosing to see if you maintain your humanoid form. Evil humanoid creatures that witness or hear about your true form become instantly hostile to you and are compelled by malice to destroy you, unless the GM decides otherwise. If the creature is scared of you or decides that you are too powerful to fight, it will attempt to harm you in another way, but will not give up on destroying you."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Radiant Strike",
            "effect": "Whenever you hit a target with a melee attack, you deal an additional 1d6 radiant damage to the target. This damage increases to 2d6 if the target is a Fiend, Fey, or Undead."
          },
          {
            "name": "Cleanse Affliction",
            "effect": "When you cast a spell that restores hit points to an ally, you can also remove one condition being inflicted on them by a spell or ability."
          },
          {
            "name": "Bow of Celestial Judgement",
            "effect": "You can use a bonus action to summon a powerful bow made of divine light. The bow is the same as a longbow, except attacks made with it deal radiant damage and have the following features:<br><br>• The bow does not use ammunition. Instead, when the wielder draws the bowstring, an ethereal arrow of radiant light forms.<br>• Attacks with the bow deal an additional 1d8 radiant damage. Against fiends, fey and undead, the bow deals an additional 2d8 radiant damage instead.<br>• The bow’s radiant form emits bright light in a 5-foot radius and dim light for an additional 5 feet.<br><br>You can unsummon the bow at any time with the use of an action. If you unwield the bow, it immediately unsummons."
          },
          {
            "name": "Holy Bulwark",
            "effect": "You may use your action to steel yourself against the tactics of your most hated adversaries, gaining one of the following benefits:\n- Stand Against the Infernal: You gain resistance to fire damage.\n- Cleanse the Undead: You gain resistance to necrotic damage.\n- Ignore Fey Trickery: You are immune to the charmed and frightened conditions.\nThis effect lasts until you use this feature again."
          }
        ],
        "flaws": [
          {
            "name": "Beacon to Darkness",
            "effect": "You have become a Seraph of noted virtue and divinity. This has made you a target for all that is dark in the world. Whenever you or an ally within 30 feet commits an act of greater evil, such as murdering a helpless innocent, a small amount of darkness attaches itself to you, and you gain 1 corruption point (to a maximum of 5). Whether the act constitutes greater evil is determined by the GM. Whenever you make an attack roll against an evil creature, or make a saving throw against a spell or ability from an evil creature, subtract the number of corruption points you have from the roll. Whenever you complete a short or long rest, and have prayed for at least 1 hour, you can reduce the number of corruption points you have by 1."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Aura of Holy Purge",
            "effect": "You emit an aura of righteous fervour. This aura radiates up to 20 feet from you while you are conscious. When you or an ally within range of your aura hits a hostile creature, they can choose for that hit to be a critical hit instead. Once a creature has benefited from this feature, they cannot benefit from it again until they have completed a long rest."
          },
          {
            "name": "Aura of Merciful Blessing",
            "effect": "You emit an aura of invigoration and fortitude. This aura radiates up to 20 feet from you while you are conscious. When you or an ally within range of your aura is reduced to 0 hit points, they are reduced to 1 hit point instead. Once a creature has benefited from this feature, they cannot benefit again until they have completed a long rest."
          },
          {
            "name": "Aura of Empyreal Valor",
            "effect": "You emit an aura of swiftness and bravery. This aura radiates up to 20 feet from you while you are conscious. When you or an ally within range of your aura makes a Dexterity ability check to determine initiative, they can add +5 to the result. In addition, on that creature’s turn they gain advantage on attack rolls against any creature that hasn’t taken a turn in the combat yet. Once a creature has benefited from this feature, they cannot benefit again until they have completed a long rest."
          },
          {
            "name": "Aura of Celestial Resilience",
            "effect": "You emit an aura of stalwart conviction. This aura radiates up to 20 feet from you while you are conscious. When you or an ally within range of your aura fails a saving throw, they can choose to succeed instead. Once a creature has benefited from this feature, they cannot benefit from it again until they have completed a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Pull of the Empyrean",
            "effect": "Your new native plane attempts to draw you to it, laying claim to your form. Whenever you roll a natural 1 for a saving throw against a magical spell or ability, you take 1d6 force damage per 2 class levels in addition to any other damage or effects you would suffer, as your native plane attempts to unbind you from the material plane. For example, a 6th level Fighter would take 3d6 force damage. This damage ignores resistances and immunities."
          }
        ]
      }
    ]
  },
  {
    "name": "Specter",
    "becoming": "Methods of becoming a specter vary, and few find their way willingly. Contact with the forces of death is the most common—a would-be hero is corrupted by the force they wanted to fight. Sinister rituals can also infuse a body with the powers of unmaking. Alongside beings and magic of death stand entities that exist in a reality undetermined from the material world as mortals understand it. These others and their minions, manifestations of otherworldly chaos, can infuse a person with that chaos, making the victim’s ultimate home a dream of cosmic horror.",
    "features": {
      "prerequisites": {
        "ability_scores": "Dexterity 13 or higher",
        "acquisition": "You must have contact with the world of the dead, either through an encounter with an undead or aberrant being, through the afterlife, or through a ritual that infuses you with death’s energy. Alternatively, you may have contact with a force that causes your material form to slip out of existence."
      },
      "save_dc": "8 + your proficiency bonus + your Dexterity modifier",
      "level_milestones": [
        "Defeat a powerful, ghostly undead and absorb its power, or defeat an aberration of similar might.",
        "Use a ritual that infuses your body with the forces of death or primordial chaos.",
        "Survive a near-death experience caused by a ghostly undead creature or aberration.",
        "Kill a significant foe with necrotic or psychic damage, or by using necromancy magic.",
        "Infuse other willing people with the power that corrupts you.",
        "Deal with ghosts, spirits, or beings of other realities as a conduit between them and mortals.",
        "Open a gate or path to places of the dead or the dreams of the Aether Kindred."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Spectral Presence",
            "effect": "Your Dexterity increases by 2 and your Charisma increases by 1. No ability score can increase above 16 in this way. If your transformation is due to contact with the afterlife, you become Undead in addition to any other creature types you are. If your transformation is due to an abnormality with reality, you become an Aberration in addition to any other creature types you are. Spells that affect Humanoids still affect you. However, you’re immune to effects that only affect a creature of your new type of a specific CR. Also, you cease aging and cannot be aged magically."
          },
          {
            "name": "Spectral Movement",
            "effect": "Your walking speed increases by 10 feet. In addition, you can move through other creatures and solid objects as if they were difficult terrain and you can move through difficult terrain as if it were normal. If you end your turn inside a creature or object, you’re shunted back to where you entered and take 1d6 force damage per 10 feet (rounded up) you travel in this way. Objects that have been in your possession less than 1 minute cannot move through creatures and objects with you. As a final benefit of this boon, due to your incorporeal nature, during your turn you have resistance to all nonmagical bludgeoning, slashing, and piercing damage from sources you can see."
          }
        ],
        "flaws": [
          {
            "name": "Close to Death",
            "effect": "Your body and soul have a tenuous grasp on existence. You have disadvantage on death saving throws as the pull of a peaceful death calls out to you. If you would be killed, the GM chooses whether you are permanently unable to be restored by magic or you transform into an incorporeal undead or aberration under the GM’s control. If you are on the Ethereal Plane, this flaw has no effect."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Ethereal Phasing",
            "effect": "You can cast the blink spell without expending a spell slot. Once you cast the spell using this boon a number of times equal to your Transformation level, you can’t do so again until you finish a long rest."
          },
          {
            "name": "Spectral Flight",
            "effect": "You gain a fly speed equal to your walking speed."
          },
          {
            "name": "Horrifying Visage",
            "effect": "As an action, you can force each creature of your choice within 30 feet of and able to see you to make a Wisdom saving throw. Targets that fail the saving throw are frightened for 1 minute. A frightened target can repeat the saving throw at the end of each of its turns, with disadvantage if you are within line of sight, ending the effect on itself on a success. You can use this boon a number of times equal to your transformation level. You regain all uses when you finish a long rest."
          }
        ],
        "flaws": [
          {
            "name": "Haunting Appearance",
            "effect": "Your true form is ghostly and haunting, whether due to your connection to death or your tenuous ties to material reality. Although your appearance isn’t necessarily scary, your spectral form seems unnatural to normal creatures who might believe you to be a ghost or other sort of spirit. You can manifest as the humanoid you once were, but doing so requires concentration on your part. Moments of stress, such as the following, reveal your hideous appearance: Using concentration, as if on or a spell; Becoming unconscious; Entering hallowed ground; Choosing to reveal your hideous appearance. In events of extreme emotional or physical stress, the GM can call for a Constitution saving throw with a DC of their choosing to see if you reveal your hideous appearance. When you reveal your hideous appearance, how viewers react is up to the GM. They might treat you as a ghost or another monster in disguise. Hostility and fear are likely reactions in these cases."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Spectral Body",
            "effect": "Your body fades further into the immaterial, giving you certain benefits and abilities: You are immune to disease, exhaustion, and poison. When you take damage other than force, you can use a reaction to gain resistance to the triggering damage and reveal your Hideous Appearance. You no longer require air, food, water, or sleep."
          },
          {
            "name": "Life Drain",
            "effect": "Your touch disrupts the life force of other beings. As an action, you can choose a creature within 5 feet to make a Constitution saving throw. On a failure, the creature takes 8d8 necrotic damage, and you gain half as many temporary hit points. If this damage causes the creature to drop to 0 hit points, the creature automatically dies and you regain an expended use of this boon. You can use this boon a number of times equal to your Transformation level. You regain all expended uses when you finish a long rest."
          },
          {
            "name": "Haunting Jaunt",
            "effect": "You can use a bonus action to choose an unoccupied space within 120 feet then fly in a direct line from your current space to that chosen space. This movement does not provoke opportunity attacks. Each creature you pass through as part of this movement must succeed on a Constitution saving throw or take 3d6 + your Dexterity modifier of psychic damage and be frightened of you until the end of your next turn. Once you use this boon, you must finish a short or long rest before you can use it again."
          }
        ],
        "flaws": [
          {
            "name": "Untethered Mind",
            "effect": "Your mind starts to follow your body in its dissolution. Less significant memories of your existence before your specter transformation start to fade like they’re dreams you’ve awakened from. The GM can claim you can’t recall something from your living past when it’s dramatic or might disadvantage you. Also, you have disadvantage whenever you attempt an Intelligence check to recall information. This lack of connection to your previous self can cause personality changes. You might forget old grudges or traumas, which can change your personality traits or alignment for the better. It’s more likely that you cling to any vestige of your old self, amplifying their importance, nursing resentments and gloomy thoughts. You might come to hate those who have a normal existence, taking a turn toward evil."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Call of Unmaking",
            "effect": "As a bonus action, you reveal your Hideous Appearance and give a mournful wail or otherwise set up a wracking vibration. This sound has no effect on constructs and undead. All other creatures of your choice within 30 feet of you must make a Constitution saving throw. Creatures that can’t hear you have advantage on the saving throw. On a failed save, the creature bears the mark of unmaking for the next minute. While bearing this mark, a creature takes an additional 1d6 necrotic damage each time it takes damage. Once you use this boon, you can’t use it again until you finish a long rest."
          },
          {
            "name": "Possession",
            "effect": "As an action, you reveal your Hideous Appearance and enter the space of a humanoid or beast and force that creature to make a Charisma saving throw. If the target fails, you disappear, and the target is incapacitated and loses control of its body. You control the body without depriving the target of awareness. While possessing a target, you can’t be targeted by any attack, spell, or other effect. You retain your alignment, Intelligence, Wisdom, Charisma, and any immunity to being charmed and frightened. Otherwise, you use the possessed target’s statistics but don’t gain access to the target’s knowledge, class features, and proficiencies. The possession lasts until the possessed target drops to 0 hit points, you end it as a bonus action, or until you are forced out by an effect that ends possession. When the possession ends, you reappear in an unoccupied space within 5 feet of the body. You can use this boon again only after you finish a short or long rest."
          },
          {
            "name": "Ethereal Denizen",
            "effect": "You can sense invisible creatures and objects, and those in the nearby Ethereal Plane, as if you are always under the effect of the see invisibility spell. Additionally, you can use an action to cast the etherealness spell without expending a spell slot. Once you cast the spell using this boon, you can’t do so again until you finish a short or long rest."
          }
        ],
        "flaws": [
          {
            "name": "Untethered Mind",
            "effect": "Your mind starts to follow your body in its dissolution. Less significant memories of your existence before your specter transformation start to fade like they’re dreams you’ve awakened from. The GM can claim you can’t recall something from your living past when it’s dramatic or might disadvantage you. Also, you have disadvantage whenever you attempt an Intelligence check to recall information. This lack of connection to your previous self can cause personality changes. You might forget old grudges or traumas, which can change your personality traits or alignment for the better. It’s more likely that you cling to any vestige of your old self, amplifying their importance, nursing resentments and gloomy thoughts. You might come to hate those who have a normal existence, taking a turn toward evil."
          }
        ]
      }
    ]
  },
  {
    "name": "Vampire",
    "becoming": "Vampires are spawned into the world when a mortal contracts the Sanguine Curse, dies, and is reborn undead. There are a variety of ways to contract the curse. A Vampire may have offered their blood to a loyal servant, powerful ally, or loved one they wished to elevate. More commonly, a Vampire may have bitten you, and you survived the Vampire’s attack long enough to contract the Sanguine Curse before perishing and being reborn. Other methods include ancient and dark magic, as well as powerful but cursed magical artifacts. Regardless of how you have become a Vampire, you should discuss with your GM what type of Vampire you would like to become, and how it can be implemented in the campaign.",
    "features": {
      "prerequisites": {
        "ability_scores": "Dexterity 13",
        "acquisition": "You must have contracted the Sanguine Curse, whether by being bitten by a Vampire, offered their blood, completing the Sanguine Ritual, or by another plausible method. Work with your GM to determine how this occurred."
      },
      "save_dc": "8 + your proficiency bonus + your Dexterity or Charisma modifier",
      "level_milestones": [
        "Establish a coven of vampire spawn.",
        "Drink the blood of a legendary monster.",
        "Learn the great secrets of vampirism from a Vampire Lord.",
        "Learn to embrace your Hideous Form and lose the ability to conceal it.",
        "Discover the lost crypts of an ancient vampire and consume its essence."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Blood Fury",
            "effect": "You have become possessed by the thirst that grips all Vampires. In combat, this thirst drives you into an insatiable frenzy of bloodshed. Whenever you deal combat damage with an unarmed strike or a melee/ranged weapon to a target that can bleed, and is not undead or a construct, you gain one Fury Point. You may only have a maximum of 4 Fury Points at any time. Upon completing a short or long rest, the number of Fury Points you have is reset to 0. These points are used by certain abilities that you can learn through your transformation levels.<br><br><b>Blood Fury Abilities</b><br>You can spend Fury Points (FP) to use the following abilities:<br><br><i>Fanged Bite (1FP)</i>: On your turn, immediately after you take the attack action, you can use your bonus action to make a special unarmed bite attack. You can use your Dexterity modifier instead of Strength to hit with this attack. This attack deals piercing damage equal to 1d4 + your Strength or Dexterity modifier. The target must then succeed at a Constitution saving throw or take 2d6 necrotic damage. You regain hit points equal to the necrotic damage dealt this way. This attack generates 1 Fury Point as normal. If this attack reduces a humanoid creature of size Medium or smaller to 0 hit points, you gain 3 Fury Points instead.<br><br><i>Calculated Strike (1FP)</i>: When you hit with a melee weapon attack, you may use this ability before damage is dealt. If you do so, you may add 1d6 of the same damage as your weapon to the damage result. If this ability is used, no Fury Points are generated for this attack.<br><br><i>Vampiric Mist (2FP)</i>: As a bonus action, you can disappear in a puff of shadowy mist and teleport up to 30 feet to an unoccupied space you can see.<br><br><i>Unearthly Reflexes (1FP)</i>: After you have rolled a Dexterity saving throw, but before the GM has determined the result, you can use your reaction and take half damage on a failed save, and no damage on a successful one.<br><br><i>Deathly Horror (3FP)</i>: As a bonus action, you can emit a ghastly distortion of your true form. A creature of your choice within 30 feet of you must succeed on a Wisdom saving throw or become Frightened of you for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. A creature that succeeds on its saving throw is immune to this ability for 24 hours."
          },
          {
            "name": "Undead Form",
            "effect": "Your Dexterity score increases by 2 and your Charisma score increases by 1. An ability score cannot be increased beyond 16 this way. In addition, your creature type changes to undead. Spells and abilities that state effects or conditions specifically regarding Undead of a specific CR have no effect on you. If a spell or ability other than your own would cause you to gain Hit Points, you gain that many temporary Hit Points instead. If you are reduced to 0 hit points and fall unconscious as a result, any healing you receive will stabilize you and leave you on 1 hit point and unconscious. Furthermore, you cannot die from old age and you do not require air, food or drink."
          }
        ],
        "flaws": [
          {
            "name": "The Sanguine Curse",
            "effect": "The sanguine curse has taken a hold on you. As a result you gain the following features:\n• You cannot enter a residence you do not own without an invitation from one of the occupants. If you enter a residence involuntarily such as by being dragged into one, you take 1d10 psychic damage at the start of your turn while you are inside it.\n• You gain Darkvision (60 ft.) if you do not already have it.\n• While in sunlight, you have disadvantage on attack rolls and ability checks.\n• You must feed every 7 days."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Dread Knight Combat Training",
            "effect": "You become trained in the martial ways of the Dread Knights. As a bonus action, you may enter, exit, or change combat stances. While in a combat stance, you gain the features of that stance.\n\nOffensive. While in this stance, you deal an additional amount of damage with your melee weapon equal to the number of Fury Points you currently possess (minimum of 1).\n\nDefensive. While in this stance, you gain a bonus to your AC equal to half the number of Fury Points you currently possess (minimum of 1).\n\nAccuracy. While in this stance, you gain a bonus to hit with your weapon attacks equal to half the number of Fury Points you currently possess (minimum of 1).\n\nAdditionally you may use Dexterity instead of Strength for the attack and damage rolls of any melee weapon with the slashing damage type."
          },
          {
            "name": "Sanguine Magic",
            "effect": "Your curse corrupts the magic you cast. Whenever you deal non-necrotic damage with a spell or cantrip, you can choose to deal necrotic damage instead. Whenever you deal damage with a spell or cantrip, you gain one Fury Point (max 1 per turn). Additionally, you gain the following Blood Fury abilities: Cast in Blood (1 FP): The next time you cast a damage-dealing cantrip, add your Charisma modifier to the damage. Sanguine Spellbinding (3 FP): The next time a creature makes a Cha, Int, or Wis saving throw against your spell, it has disadvantage. If the spell affects multiple creatures, you choose which creature is affected."
          },
          {
            "name": "Shapechanger",
            "effect": "You can use an action to polymorph into a Tiny bat or back. In bat form: Walking speed 5 ft, flying speed 30 ft. Sunlight hypersensitivity reduced to sensitivity (disadvantage on attack rolls/ability checks in sunlight, but no damage). Cannot speak; objects/armor merge or drop. Revert if unconscious. You can also turn into mist: Cannot act, speak, or manipulate objects. Weightless, flying speed 20 ft, can hover, enter hostile spaces. Can pass through air-sized gaps, but not liquid or running water. Advantage on Str, Dex, Con saves. Immune to all non-magical damage except sunlight. Objects/armor merge or drop. Revert if unconscious."
          },
          {
            "name": "Night Stalker",
            "effect": "You gain proficiency in Stealth. If you already have proficiency in Stealth, then your proficiency bonus is doubled when making Stealth ability checks. You can attempt to hide even when only lightly obscured, including dim light. You also gain a climb speed equal to your walking speed, allowing you to climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
          }
        ],
        "flaws": [
          {
            "name": "Hideous Appearance",
            "effect": "Your body alters: pale skin, fangs, burns from sun, no reflection. You can hide your appearance but stress may reveal it. Revealed when: Concentrating on a spell. Gaining the unconscious condition. Entering hallowed ground. Taking sunlight or free-flowing water damage. Choosing to reveal. On extreme stress, GM may call for Con save to maintain humanoid form."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Cruel Riposte",
            "effect": "Whenever a creature within 5 feet of you makes an attack against you, you may use your reaction to make a melee weapon attack against the attacking creature. You may use this feature a number of times equal to your Dexterity modifier (minimum of 1). You regain all expended uses of this feature when you complete a long rest."
          },
          {
            "name": "Creatures of the Night",
            "effect": "Once per long rest, you can magically call to your aid 2d4 swarms of bats or 2d4 swarms of rats. When outdoors, you can summon 2d4 wolves instead of swarms of rats. These creatures arrive at the end of your next turn at a destination of the GM’s choice within 30 feet of you, and they are under your control. They act directly after you in the initiative order and remain for 1 hour, until you die, or until you dismiss them with a bonus action. You cannot use this ability if you are exposed to direct sunlight."
          },
          {
            "name": "Captivating Glance",
            "effect": "You gain proficiency in Deception and Persuasion. If you are already proficient in one of these skills, then your proficiency bonus is doubled for ability checks using that skill. If you have or ever gain double proficiency in one or both of these skills, you gain +2 for that skill instead.<br><br>Additionally, your thoughts cannot be read by any means."
          },
          {
            "name": "Improved Shapechanger",
            "effect": "You may also take on the form of a dire wolf when using your Shapechanger ability. In dire wolf form, your movement speed changes to 50 feet, and if you have sunlight hypersensitivity it becomes sunlight sensitivity (you have disadvantage on attack rolls and ability checks in sunlight but take no damage). While in dire wolf form, you cannot speak. Any object you are holding or wearing merges into your wolf form or drops to the ground, as the GM decides. If you become unconscious, you revert back to your vampiric form. Additionally, your Fanged Bite ability changes based on form: in bat form it deals 1 piercing damage, in dire wolf form it deals 2d6 piercing damage."
          }
        ],
        "flaws": [
          {
            "name": "Greater Sanguine Curse",
            "effect": "Your curse has taken a stronger hold on you. As a result you gain the following features:<br>• You take 1d10 acid damage if you end your turn in running water.<br>• You gain superior Darkvision (120 ft.) if you do not already have it.<br>• You take 1d10 radiant damage when you start your turn in sunlight.<br>• You must feed every 3 days."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Grim Executioner",
            "prerequisite": "Dread Knight Combat Training",
            "effect": "You have mastered the martial techniques of the Dread Knight. Whenever you roll a critical hit with a melee or ranged weapon, and the target has 50 or fewer hit points, you kill the target outright. If your target has more than 50 hit points, you deal an extra 6d6 damage. This damage is of the same type as your weapon."
          },
          {
            "name": "Beguiler’s Entrancement",
            "prerequisite": "Captivating Glance",
            "effect": "Once per long rest, you gain the ability to manipulate the mind of a humanoid with your sanguine magic. You can use an action to make an incapacitated humanoid charmed by you for 24 hours or until you target a different humanoid with this ability. If you use this ability on the same target for 30 unbroken days, the target becomes permanently charmed by you.<br><br>You may use this ability on another humanoid once you have permanently charmed the previous humanoid. You can have a maximum number of enthralled humanoids equal to your Charisma Modifier (minimum of 1). If the number of enthralled humanoids exceeds your Charisma modifier for any reason, you lose connection to all of them.<br><br>This charm effect can be removed with the remove curse spell, or any other spell or ability with similar effects."
          },
          {
            "name": "Regenerate",
            "effect": "You regain 10 hit points at the start of your turn if you have at least 1 hit point remaining, and are not in sunlight or over running water.<br><br>If you take radiant damage or damage from holy water, this ability does not function at the start of your next turn."
          },
          {
            "name": "Innate Sangromancy",
            "effect": "You know all Sangromancy Spells. When casting a spell using Sangromancy, you may use FP instead of spending hit dice. Treat these FP as 1d12 hit dice. When you cast a spell in this way you do not generate FP from Sanguine Magic and you may choose a single effect to apply by spending additional FP: Beguiling Spell (2 FP) – Charm the target until the end of your next turn. Shadow Spell (2 FP) – Target is unable to perceive you until the end of your next turn. Withering Spell (3 FP) – Add 1d8 necrotic damage per spell level; target cannot take reactions until the end of your next turn. Vampiric Spell (3 FP) – Heal for half the necrotic damage dealt."
          }
        ],
        "flaws": [
          {
            "name": "Stake to Heart",
            "effect": "Whenever you’re attacked by a creature with a wooden or silvered weapon, if they score a natural 20 to hit, and you have 50 hit points or less, they manage to lodge their weapon into your heart and you become paralyzed for 1 hour or until the weapon is removed, whichever is greater."
          }
        ]
      }
    ]
  },
  {
    "name": "Wyrm",
    "becoming": "Becoming a Wyrm requires communing with Gormadraug by displaying an aptitude for pyrrhic victory in the name of revenge, or absorbing a portion of his essence from either coldfire or his physical remains. The Prismatic Wyrm’s enemies are many and have made efforts to scour his likeness from the face of Etharis, so obtaining such a relic is a difficult task even for the most seasoned adventurer. For those who seek the power of dragons and coldfire, however, there is no greater prize. Every step along the path of growing in power brings a Wyrm closer to the image of Gormadraug. Inevitably, the powers granted by this transformation draw a Wyrm into conflict with Gormadraug’s enemies, such as the Arch Seraphs or other primordials, and their minions. As a creature fueled by hatred, destroying the Prismatic Wyrm’s enemies is the quickest way to gain more of his strength.",
    "features": {
      "prerequisites": {
        "ability_scores": "Constitution 13",
        "acquisition": "Find one of Gormadraug’s eggs hidden in the frozen wastes and imbibe its yolk raw, walk into an inferno of coldfire while shouting a fervent prayer to the Prismatic Wyrm, catch the attention of Gormadraug’s sleeping consciousness by committing an act of revenge at great personal cost, or another method determined with your GM."
      },
      "save_dc": "8 + your proficiency bonus + your Constitution modifier",
      "level_milestones": [
        "Striking terror into the hearts of mortals such that they are compliant to your whims.",
        "Thwarting the plans of one of the other primordials.",
        "Dealing a grievous injury or setback to one of the other primordials.",
        "Initiating or spreading a massive outbreak of coldfire.",
        "Making contact with Gormadraug’s sleeping consciousness."
      ]
    },
    "transformation_levels": [
      {
        "level": 1,
        "boons": [
          {
            "name": "Wyrm Form",
            "effect": "Your Constitution score increases by 2 and your Charisma score increases by 1. An ability score cannot be increased beyond 16 in this way.<br><br>You gain the Dragon creature type in addition to any other creature types you are. Spells and abilities that affect dragons of a specific CR have no effect on you."
          },
          {
            "name": "Glittering Scales",
            "effect": "You are covered in glittering dark scales that shimmer with a rainbow hue in the light, and your body has partially transformed into a sinuous draconic shape. You gain the following benefits:<br>• While you are not wearing armor, your AC equals 13 + your Constitution modifier.<br>• You have resistance to cold damage.<br>• Your teeth sharpen, your hands turn to claws, and you have grown a tail. You can use any one of these to make unarmed strikes. If you use your tail, your reach is increased by 5 feet. When you hit with one of these natural weapons, the strike deals 1d6 + your Strength or Dexterity modifier damage, instead of the normal damage for an unarmed strike. If you use your teeth, the damage is piercing; if you use your claws, the damage is slashing; and if you use your tail, the damage is bludgeoning."
          }
        ],
        "flaws": [
          {
            "name": "Somnolent Curse",
            "effect": "You share Gormadraug’s curse: easily set to sleep but rarely refreshed by the slumber. Your current hit points are considered half of what they are for the purpose of the sleep spell. When you finish a long rest with one or more levels of exhaustion, you gain a level of exhaustion as normal but gain no other benefits of having finished a long rest."
          }
        ]
      },
      {
        "level": 2,
        "boons": [
          {
            "name": "Coldfire Breath",
            "effect": "You can use your bonus action to exhale a blast of coldfire in a 15-foot cone. When you do, each creature within the cone must succeed on a Dexterity saving throw or take 3d6 cold damage. In addition, terrain within the cone is now burning with coldfire for 1 minute. Each time a creature starts its turn in, or moves through, a space with coldfire in it, the creature takes 3d6 cold damage. Increase the damage for both initial and lingering effects by 1d6 for each transformation level above 2.<br><br>You can use this boon a number of times equal to your Constitution modifier (minimum once), regaining all expended uses after finishing a long rest."
          },
          {
            "name": "Draconic Wings",
            "effect": "A pair of leathery wings emerge from your back. While you are not wearing armor, or are wearing armor suited for your wings, you have a flying speed of 30 feet."
          },
          {
            "name": "Make Lair",
            "effect": "You have learned how to twist the natural geomantic energies of a place to your liking, giving you the ability to create a lair. To do this, you must remain in the same 100-foot-square area for at least 8 hours a day for 7 days. At the end of this time, the area is your lair until you use this boon again to make a new lair. You gain the following benefits in your lair:<br>• You cannot be surprised, and have advantage on Wisdom (Perception) checks.<br>• You can store treasure and gold in your lair. When you finish a long rest in your lair, you gain a number of temporary hit points equal to the gp value of the treasure and gold in your lair, up to a maximum of half your maximum hit points.<br>• Your lair is filled with snowflakes glowing in blue flame. During combat, on initiative count 20, you can choose any 10-foot-square area in your lair. Each creature within that area must succeed on a Constitution saving throw or take 3d6 cold damage and have its movement speed halved until the end of its next turn."
          }
        ],
        "flaws": [
          {
            "name": "Hateful Heart",
            "effect": "The hate of Gormadraug against those who have wronged him also flows through you. Celestials and elementals, other than those composed of coldfire or otherwise allied with Gormadraug, count as hated enemies. You have disadvantage on ability checks and attack rolls while you can see a hated enemy within 60 feet, unless you are making an attack roll or other roll to harm one of those particular hated enemies."
          }
        ]
      },
      {
        "level": 3,
        "boons": [
          {
            "name": "Frightful Presence",
            "effect": "As an action, you can let out a courage-wilting roar. Each creature of your choice within 60 feet must succeed on a Wisdom saving throw or become frightened of you for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature succeeds at one of these saving throws, or the minute of being frightened passes, that creature cannot be frightened by this boon again for the next 24 hours."
          },
          {
            "name": "Prismatic Scales",
            "effect": "The glittering scales multiply across your body as it swells and distends, your shape becoming even more draconic and even less humanoid. With each passing day you more closely resemble the Prismatic Wyrm himself. While active, you gain the following benefits: If you are smaller than Large, your size increases to Large. The damage from your bite, claw, and tail increases to 2d6 + your Strength or Dexterity modifier. You have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."
          },
          {
            "name": "Wing Buffet",
            "effect": "Your wings have grown stronger. The flying speed granted by your wings increases to 40 feet. In addition, you can use your bonus action to flap your wings, causing a tremendous, localized wind. When you do, each creature within 10 feet of you must succeed on a Strength saving throw or be knocked prone or pushed 10 feet (your choice)."
          }
        ],
        "flaws": [
          {
            "name": "Tundral Temperature",
            "effect": "You are uncomfortable in hot climates. While you are in hot climates, you must rest for twice as long to gain the benefit of a short or long rest. In addition, you exude frigid cold, causing vapor to rise around you while in hot climates. You have disadvantage on Dexterity (Stealth) and Wisdom (Perception) checks made in areas where the temperature is above freezing."
          }
        ]
      },
      {
        "level": 4,
        "boons": [
          {
            "name": "Indestructible Heart",
            "effect": "Like Gormadraug, your heart is made of indestructible magical ice. No matter how you die, even if you are disintegrated, your heart remains. While you are dead, each day that passes your body regenerates around your indestructible heart, until a number of days have passed equal to your maximum hit points. On that day, you return to life in the location of your heart with five levels of exhaustion. A creature can delay your regeneration by keeping your indestructible heart soaked in fresh blood. This requires at least one pint of blood that must have been taken from a creature with an Intelligence greater than 3. After 24 hours, the blood loses its potency and unless it is refreshed with new blood your heart restarts the regeneration process. At your GM’s discretion, they may specify a legendary quest needed to overcome your heart’s indestructible nature, allowing it to be permanently destroyed."
          },
          {
            "name": "Legendary Resistance",
            "effect": "When you fail a saving throw, you can use your reaction to succeed on the saving throw instead. When you do, you must succeed on a DC 15 Constitution saving throw or gain a level of exhaustion. You can use this reaction a number of times equal to your Constitution modifier (minimum once), regaining all expended uses upon completing a long rest."
          },
          {
            "name": "Primordial Coldfire Breath",
            "effect": "When you use your Coldfire Breath Transformation Boon, you can choose to increase the size to a 30-foot cone or increase the initial and lingering cold damage dealt to 6d6. If you expend two uses of your Coldfire Breath instead of one, you can choose both. Finally, you regain one use of your Coldfire Breath when you finish a short rest."
          }
        ],
        "flaws": [
          {
            "name": "Rising Rage",
            "effect": "The desire for revenge has poisoned your heart as surely as it did the Prismatic Wyrm’s. When a creature deals damage to you, you consider that creature a hated enemy for the next 10 days. While that hated enemy exists, you are distracted and have disadvantage on all ability checks that are not made directly against a hated enemy."
          }
        ]
      }
    ]
  }
]
